library(tidyverse)
library (markdown)
library(shiny)
library(readr)
library(shinythemes)
library(DT)
library(xlsx)
#graph_t <- read_delim("graph.csv", delim = ";", escape_double = FALSE)
#rozd<-read_delim("rozd.csv", delim = ";", escape_double = FALSE)
rule<-read_delim("rule.csv", delim = ";", escape_double = FALSE)
  #articles<-read_delim("article.csv", delim = ";", escape_double = FALSE)
#art_vis<-read_delim("art_vis.csv", delim = ";", escape_double = FALSE)
#comment<-read_delim("comment.csv", delim = ";", escape_double = FALSE)
load ("crimes_ukr.RData")
load ("articles.RData")
load ("crimes_dsa_ukr.RData")
articles<-articles2
name_n<-names(crimes)[5:115]  
field_n<-read_delim("field_n.csv", delim = ";", escape_double = FALSE)
chapter_label <- c("I","II","III","IV","V","VI","VII","VIII","IX","X",
                   "XI","XII","XIII","XIV","XV","XVI","XVII","XVIII","XIX","XX","КК 1960")

chapter<-read_delim("chapter.csv", delim = ";", escape_double = FALSE)


require(scales)
point <- format_format(big.mark = " ", decimal.mark = ",", scientific = FALSE)

ui <- 
  navbarPage ("Протидія злочинності в Україні: інфографіка. Версія 2.0",
    
                  tabPanel( "Про довідник", 
                           
                             navlistPanel(
                              tabPanel("Чому варто звернути увагу",
 h3("Інтерактивний довідник 'Протидія злочинності в Україні: інфографіка'"),                                      
 hr(),
 tags$ul(
   tags$li(h4("період спостережень охоплює ", strong("десять років (2013-2022)"))),
     tags$li(h4(strong("більше ніж 100 параметрів"),"аналізу застосування 
   кримінального законодавства", )), 
  tags$li(h4("набір даних, який налічує ", strong ("1,45 мільйона"),
  " показників функціонування національної системи кримінальної юстиції.")), 
  tags$li(h4("режим ", strong("створення власних візуалізацій 
  та наборів даних,")," можливість комбінувати параметри, 
  визначати період спостережень, рівень узагальнення, 
  та необхідність обрахунку відносних значень")),
  tags$li(h4("одна з перших спроб систематизувати 
  статистичні дані щодо протидії злочинності у форматі ", strong("відтворюваного дослідження 
  за методологією Data Science.")))
  ),
 hr(),
 h4("результати використання довіднику у науковій публікації ", 
    tags$a("Карчевський М.(2022) Протидія злочинності в Україні у форматі data science",href= "https://karchevskiy.org/2022/10/28/art1/")),
 hr(),
 fluidRow(column(12,align="center",
                 HTML ('<iframe width="560" height="315" src="https://www.youtube.com/embed/2QkI_DYwsPk" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>')))
 ),
  
                             
 
  tabPanel("Як отримано дані та створено візуалізації",
h4("У довіднику систематизовано щорічні статистичні звіти Офісу Генерального 
   Прокурора України та Державної судової адміністрації України"), 
 hr(),  
tags$ul(
   tags$li(h5("Єдиний звіт про кримінальні правопорушення. Форма №1.")),
   tags$li(h5("Звіт про осіб, притягнутих до кримінальної 
              відповідальності та види кримінального покарання. Форма №6")),
   tags$li(h5("Звіт про склад засуджених. Форма №7."))
      ),
   hr(),
h4("Збір даних здійснено шляхом завантаження звітів, представлених на 
офіційних інтернет-представництвах ОГП та ДСА.
Посилання на звіти додано до відповідних програмних скриптів. 
Виконання скриптів дає змогу отримати локальні копії вхідних даних"),
hr(),
h4("На підставі аналізу особливостей структури вхідних звітів було 
розроблено скрипти очищення даних. Отримані звіти було трансформовано на дані, придатні для автоматизованого опрацювання («чисті» дані)"),
hr(),
h4("За допомогою розроблених скриптів автоматизованої обробки з 
«чистих» даних створено добірки та узагальнення для дальших візуалізацій"),
hr(),
h4("Візуалізації отримано знову ж таки через виконання скриптів, 
що використовують добірки, отримані на попередньому етапі, 
і стандартні бібліотеки графічного представлення даних."),
hr()
   
   ),
tabPanel ("Відтворюване дослідження за методологією Data Science",
          
h4("Статистичні дані дають змогу отримати уявлення про закономірності й тенденцій 
   протидії злочинності. Їх аналіз є важливим складником процесу прийняття рішень 
   у галузі кримінально-правового регулювання. Водночаc, однією з актуальних проблем с
   учасної науки про суспільство є криза реплікації. Результати багатьох досліджень 
   неможливо отримати в спосіб їх повторення, важко перевірити. Це ставить під сумнів зміст 
   і обсяг знань про суспільство."),
hr(),
h4("Головним наслідком кризи реплікації є втрата довіри до науки як такої.
   Неможливість відтворити дослідження нівелює якість наукових аргументів у суспільному дискурсі, піддає сумнівам доцільність їх використання."),
hr(),
h4("Проте, не все так сумно 😊. Оновлення методології сучасних досліджень створює можливості 
для виходу з кризи реплікації. Якісно новий рівень довіри мають наукові розвідки, де методологічно забезпечена 
можливість відтворення результатів. Такі дослідження називають відтворюваними (reproducible research)."),
hr(),
h4("Цей довідник є результатом роботи з даними кримінальної статистики за методологією Data Science
   і ",strong("є повністю відтворюваним."), "Дослідники можуть повторити процес завантаження 
   вхідних даних з офіційних інтернет-джерел, відтворити трансформацію цих даних 
   у форму, що дає можливість їх автоматизованої обробки, а також перевірити 
   коректність обробки даних і відтворити візуалізації, які наведено в роботі."),
hr(),
h4("Репозитарій із вхідними звітами та очищеними даними, розробленими нами скриптами для збору, 
   очищення, обробки даних та створення
   візуалізацій", tags$a("представлено у вільному доступі", href= "https://github.com/Nickolay78/Combating-Crime-in-Ukraine-2013-2021"))
          
          ),

tabPanel ("Робота з відомостями щодо загальних або групових тенденцій та дослідження протидії окремим видам кримінальних правопорушень",
          
          h4("За посиланням", strong("'Загальні характеристики'"), "можна отримати відомості про загальні тенденції
             кримінально-правового регулювання. Необхідно обрати тільки показник (кілька показників) статистичної звітності, а довідник
             узагальнить дані та запропонує розподіл значень цього показника (показників) за розділами Особливої частини та за роками. 
             Означені дані представляються графічно у вигляді абсолютних значень (візуалізація 1) та відсоткових (візуалізація 2).
             Для обчислення відсоткового представлення як 100% використовується сумарне значення обраного показника за певний рік.",
             em(" Наприклад: у означеному розділі довідника Ви обрали показник 'Засуджено жінок'. В результаті Ви отримаєте
             розподіл кількості засуджених жінок за розділами Особливої частини та за роками (візуалізація 1), а також відсотковий розподіл
             цього показника (візуалізація 2), де буде позначено частку жінок, засуджених за кримінальні правопорушення,
             передбачені окремими розділами, відносно всіх засуджених жінок у певному році")),
          hr(),
          h4("За посиланням", strong("'Групові особливості'"), "можна отримати відомості щодо
             кримінально-правової протидії правопорушенням, передбаченим статтями окремих розділів Особливої частини КК.
             Необхідно обрати розділ та показники статистичної звітності, а довідник
             узагальнить дані та запропонує розподіл значень цих показників за статтями визначеного розділу та за роками. 
             Означені дані представляються графічно у вигляді абсолютних значень (візуалізація 1) та відсоткових (візуалізація 2).
             Для обчислення відсоткового представлення як 100% використовується сумарне значення обраного показника для визначеного 
             розділу Особливої частини за певний рік.", 
             em(" Наприклад: у означеному розділі довідника Ви обрали показник 'Обліковано проваджень' та 
             другий розділ Особливої частини КК. В результаті Ви отримаєте розподіл кількості проваджень, облікованих 
             за статтями Розділу ІІ Особливої частини КК та за роками (візуалізація 1), а також відсотковий розподіл
             цього показника (візуалізація 2), де буде визначено частки облікованих проваджень за кожною із статей розділу,
                відносно проваджень щодо правопорушень проти життя та здоров'я, облікованих у певному році")),
          hr(),
          h4("За посиланням", strong("'Окремі правопорушення'"), "можна отримати відомості щодо
             протидії окремим кримінальним правопорушенням.
             Необхідно статтю Особливої частини КК та показники статистичної звітності, а довідник
             узагальнить дані та запропонує розподіл значень цих показників за частинами визначеної статті та за роками.
             Означені дані представляються графічно у вигляді абсолютних значень (візуалізація 1) та відсоткових (візуалізація 2).
             Для обчислення відсоткового представлення як 100% використовується сумарне значення обраного показника для визначеної 
             статті Особливої частини за певний рік.", 
             em(" Наприклад: у означеному розділі довідника Ви обрали показник 'Засуджено осіб' та 
             статтю 115 КК. В результаті Ви отримаєте розподіл кількості засуджених за умисне вбивство за частинами ст. 115 КК 
             та за роками (візуалізація 1), а також відсотковий розподіл
             цього показника (візуалізація 2), де буде визначено частки засуджених за просте умисне вбивство (ч.1 ст. 115 КК) та кваліфіковане 
             (ч.2 ст. 115 КК), відносно засуджених за ст. 115 КК у певному році."),
             strong("Важливо! "), "У даному розділі довідника представлено тільки дані Державної судової адміністрації. Звіти 
             Офісу Генерального Прокурора не містять окремих даних щодо частин певних статей Особливої частини. Тому порівняння показників звітів
             ОГП та ДСА можливе тільки за статтями. Даний функціонал реалізовано у Конструкторі візуалізацій"),
          hr()
),


 tabPanel ("Робота у режимі конструктора",
h4("За посиланням ",strong("'Конструктор візуалізацій'"), "предбачено можливість
  створювати власні візуалізації"),
hr(),
h4("Візуалізація конструюється шляхом визначення
   показників для дослдження, часу спостережень та рівня узагальнення. За замовченням
   конструктор налаштований на відображення одного показника - Кількість облікованих проваджень -
   за весь період спостережень(без розподілу за роками), для всіх статей Особливої частини КК 
   (без розподілу за розділами чи статтями)."),
hr(),
h4("Вибір показників для дослідження, Розділів та статей Особливої частини КК є ",
   strong("множинним."),"Користувач довідника самостійно визначає кількість показників, 
   розділів або статей для візуалізації."),
hr(),
h4("Можливим є вибір зі списку або шляхом введення бажаного параметру (в цьому разі довідник
   формуватиме список для вибору з параметрів, що відповідають введеним символам)"),
fluidRow(column (6,align="center", img(src="list.png",height=200),
                 p(em("вибір зі списку"),style="text-align:center")),
         column (6,align="center", img (src="clist.png",height=200),
                 p(em("вибір шляхом вводу символів")))
  ),#End of Row
hr(),
h4("У разі необхідності скасувати обрані варіанти показників, розділів або статей,
виділіть обраний варіант лівою кнопкою миші та натисніть ", strong("Delete")),
hr(),
h4("У разі необхідності побудувати візуалізацію з відносними значеннями потрібно
   вказати базову перемінну. Для вибору довідник пропонуватиме список з 
   обраних показників дослідження. На візуалізації відносних значень базова перемінна 
   буде мати значення 100%"),
hr(),
h4("Після визначення параметрів за посиланням ", strong ("'Дані конструктора візуалізацій'"),
   "Ви знайдете сформований набір даних у вигляді таблиць з елементами керування"),
hr(),
h3 ("Параметри для дослідження, на підставі яких можна побудувати візуалізацію"),
fluidRow(column(4,
                p("Обліковано кримінальних правопорушень"),
                p("Кримінальні правопорушення, у яких особам вручено повідомлення про підозру"),
                p("Проваджень скеровано до суду з обвинувальним актом"),
                p("Проваджень скеровано до суду з клопотанням про звільнення від кримінальної відповідальності"),
                p("Проваджень скеровано до суду з клопотанням про застосування примусових заходів медичного характеру"),
                p("Проваджень скеровано до суду з клопотанням про застосування примусових заходів виховного характеру"),
                p("Закінчені провадження щодо правопорушень, вчинених особами, які раніше вчиняли  кримінальні правопорушення"),
                p("Закінчені провадження щодо правопорушень, вчинених групою осіб"),
                p("Закінчені провадження щодо правопорушень, вчинених особами у стані алкогольного сп'яніння"),
                p("Закінчені провадження щодо правопорушень, вчинених неповнолітніми  або за їх  участю"),
                p("Осіб, вироки (постанови) щодо яких набрали законної сили"),
                p("Засуджено осіб"),
                p("Виправдано осіб"),
                p("Неосудних, до яких застосовано примусові заходи медичного характеру"),
                p("Справи закрито (разом)"),
                p("Справи закрито у зв’язку з дійовим каяттям"),
                p("Справи закрито у зв’язку з примиренням винного з потерпілим"),
                p("Справи закрито у зв’язку із зміною обстановки"),
                p("Справи закрито у зв’язку з передачею особи на поруки"),
                p("Справи закрито у зв’язку з амністією"),
                p("Справи закрито у зв’язку зі смертю"),
                p("Справи закрито з інших підстав"),
                p("Справи закрито оскільки існує вирок або ухвала про закриття кримінального провадження по тому самому обвинуваченню"),
                p("Справи закрито за відсутністю події, складу злочину чи недоведеністю обвинувачення"),
                p("Справи закрито у зв’язку з відмовою прокурора або потерпілого, його представника від обвинувачення в кримінальному провадженні"),
                #p("Справи закрито у зв’язку із застосуванням примусових заходів виховного характеру до неповнолітнього"),
                p("Призначено довічне позбавлення волі"),
                p("Призначено позбавлення волі на певний строк"),
                p("Позбавлення волі строком 1 рік"),
                p("Позбавлення волі строком понад 1 рік до 2 років включно"),
                p("Позбавлення волі строком понад 2 роки до 3 років включно"),
                p("Позбавлення волі строком понад 3 роки до 5 років включно"),
                p("Позбавлення волі строком понад 5 років до 10 років включно"),
                p("Позбавлення волі строком понад 10 років до 15 років включно"),
                p("Позбавлення волі строком понад 15 років до 25 років включно"),
                p("Призначено обмеження волі"),
                p("Призначено тримання в дисциплінарному батальйоні")
                
                ),#firstC
         column(4,
                p("Призначено арешт"),
                p("Призначено виправні роботи"),
                p("Призначено службове обмеження для військовослужбовців"),
                p("Призначено громадські роботи"),
                p("Призначено штраф"),
                p("Призначено позбавлення права займати певні посади або займатися певною діяльністю"),
                p("Звільнено від покарання з випробуванням"),
                p("Звільнено від покарання унаслідок акта амністії"),
                p("Звільнено від покарання з інших підстав"),
                p("Засуджено громадян України"),
                p("Засуджено громадян іншої держави"),
                p("Засуджено жінок"),
                p("Засуджено за правопорушення, вчинені у складі групи"),
                p("Засуджено за правопорушення, вчинені у складі організованої групи"),
                p("Засуджено за правопорушення, вчинені у складі злочинної організації"),
                p("Засуджено за правопорушення, вчинені стані алкогольного сп`яніння"),
                p("Засуджено за правопорушення, вчинені стані наркотичного сп`яніння "),
                p("Засуджено за правопорушення, вчинене у віці від 14 до 16 років "),
                p("Засуджено за правопорушення, вчинене у віці від 16 до 18 років"),
                p("Засуджено за правопорушення, вчинене у віці від 18 до 25 років"),
                p("Засуджено за правопорушення, вчинене у віці від 25 до 30 років "),
                p("Засуджено за правопорушення, вчинене у віці від 30 до 50 років"),
                p("Засуджено за правопорушення, вчинене у віці від 50 до 65 років"),
                p("Засуджено за правопорушення, вчинене у віці від 65 років і старше"),
                p("Заняття засуджених на момент вчинення правопорушення - робітники"),
                p("Заняття засуджених на момент вчинення правопорушення - державні службовці"),
                p("Заняття засуджених на момент вчинення правопорушення - інші службовці"),
                p("Заняття засуджених на момент вчинення правопорушення - військовослужбовці"),
                p("Заняття засуджених на момент вчинення правопорушення - лікарі, фармацевти"),
                p("Заняття засуджених на момент вчинення правопорушення - вчителі, викладачі "),
                p("Заняття засуджених на момент вчинення правопорушення - працівники засобів масової інформації"),
                p("Заняття засуджених на момент вчинення правопорушення - приватні підприємці"),
                p("Заняття засуджених на момент вчинення правопорушення - працівники господарських товариств"),
                p("Заняття засуджених на момент вчинення правопорушення - учні шкіл, ліцеїв, коледжів, гімназій"),
                p("Заняття засуджених на момент вчинення правопорушення - студенти навчальних закладів"),
                p("Заняття засуджених на момент вчинення правопорушення - інші заняття"),
                p("Заняття засуджених на 
                  момент вчинення правопорушення - пенсіонери, у т.ч. інваліди")
                
                ),#secondC
         column(4,
                p("Заняття засуджених на момент вчинення правопорушення - безробітні"),
                p("Заняття засуджених на момент вчинення правопорушення - працездатні, які не працювали і не навчалися "),
                p("Засуджені працездатні, які не працювали і не навчалися, та мають незняту і непогашену судимість (з гр. 31)"),
                p("Заняття засуджених на момент вчинення правопорушення - неповнолітні до 16 років, які не працювали і не навчалися"),
                p("Заняття засуджених на момент вчинення правопорушення - утримувалися в установі виконання покарань, під вартою"),
                p("Освіта на час вчинення правопорушення - повна вища"),
                p("Освіта на час вчинення правопорушення - базова вища"),
                p("Освіта на час вчинення правопорушення - професійнотехнічна"),
                p("Освіта на час вчинення правопорушення - повна загальна середня"),
                p("Освіта на час вчинення правопорушення - базова загальна середня"),
                p("Освіта на час вчинення правопорушення - початкова загальна"),
                p("Освіта на час вчинення правопорушення - без освіти"),
                p("Засуджені, які раніше вчинили злочин, але були звільнені від кримінальної відповідальності"),
                p("Засуджені, які судилися, але визнані такими, що не мають судимості"),
                p("Засуджені, які судилися, але судимість погашена чи знята"),
                p("Засуджені, які мають незняту і непогашену судимість"),
                p("Засуджені, які мають одну судимість"),
                p("Засуджені, які мають дві судимості"),
                p("Засуджені, які мають три і більше судимостей"),
                p("Засуджені, які мають судимість за правопорушення проти життя чи здоров’я особи"),
                p("Засуджені, які мають судимість за правопорушення проти статевої свободи чи статевої недоторканості особи"),
                p("Засуджені, які мають судимість за правопорушення проти власності"),
                p("Засуджені, які мають судимість за правопорушення проти безпеки руху та есплуатації транспорту"),
                p("Засуджені, які мають судимість за правопорушення проти громадського порядку, моральності"),
                p("Засуджені, які мають судимість за правопорушення пов`язані з наркотиками"),
                p("Засуджені, які мають судимість за інші кримінальні правопорушення "),
                p("Засуджені, які мають судимість та відбули покарання повністю"),
                p("Засуджені, які мають судимість та були звільнені від покарання (усього)"),
                p("Засуджені, які мають судимість та були звільнені від покарання умовнодостроково"),
                p("Засуджені, які мають судимість та були звільнені у зв’язку з амністією"),
                p("Засуджені, які мають судимість та були звільнені від покарання з інших підстав"),
                p("Засуджені, які мають судимість та скоїли злочин, не відбувши покарання (усього)"),
                p("Засуджені, які мають судимість та скоїли злочин, не відбувши покарання у вигляді позбавлення чи обмеження волі або арешту"),
                p("Засуджені, які мають судимість та скоїли злочин у період відбуття покарання в місцях позбавлення  чи обмеження волі або арешту"),
                p("Засуджені, які мають судимість та учинили злочин у період іспитового сроку"),
                p("Засуджені, які мають 
                  судимість та учинили злочин у період відбуття іншого покарання")
                
                )#thirdC
  
)#End of Row

            ),#End of Construct.me                
tabPanel("Автор та розробник",
         img(src="km.png",height=250),
         h4 ("професор ", strong("Микола Карчевський")),
         h4 (a("karchevskiy.org",href="https://karchevskiy.org/")),
         hr(),
         h4("Створення цієї версії довіднику відбулося за істотної підтримки Львівського державного університету внутрішніх справ та Науково-дослідного 
         інституту вивчення проблем злочинності імені академіка В.В. Статшиса НАПрН України. Щиро вдячний за це ", 
            strong ("професору Роману Благуті, професору Тарасу Созанському, та професорці Владиславі Батиргарєєвій"))
     
         
           
         
         )#End of Author
                     )
                              
                  ),
              
tabPanel("Загальні характеристики",
         
         sidebarLayout(
           sidebarPanel(
             
             selectInput(inputId = "fieldsYR",
                         label = "Оберіть показники для дослідження:",
                         choices = c(
                           "Обліковано кримінальних правопорушень"="ACC",
                           "Кримінальні правопорушення, у яких особам вручено повідомлення про підозру"="SUSP",
                           "Проваджень скеровано до суду з обвинувальним актом"="INDICM",
                           "Проваджень скеровано до суду з клопотанням про звільнення від кримінальної відповідальності"="REL",
                           "Проваджень скеровано до суду з клопотанням про застосування примусових заходів медичного характеру"="MED",
                           "Проваджень скеровано до суду з клопотанням про застосування примусових заходів виховного характеру"="EDU",
                           "Проваджень скеровано до суду (разом)"="TOTPROV",
                           "Закінчені провадження щодо правопорушень, вчинених особами, які раніше вчиняли  кримінальні правопорушення"="RECID",
                           "Закінчені провадження щодо правопорушень, вчинених групою осіб"="GROUP",
                           "Закінчені провадження щодо правопорушень, вчинених особами у стані алкогольного сп'яніння"="INTOX",
                           "Закінчені провадження щодо правопорушень, вчинених неповнолітніми  або за їх  участю"="JUVEN",
                           "Осіб, вироки (постанови) щодо яких набрали законної сили"="CRTOT",
                           "Засуджено осіб"="CONVIC",
                           "Виправдано осіб"="ACQUIT",
                           "Неосудних, до яких застосовано примусові заходи медичного характеру"="CMED",
                           "Справи закрито (разом)"="CCLOSE",
                           "Справи закрито у зв’язку з дійовим каяттям"="CONFES",
                           "Справи закрито у зв’язку з примиренням винного з потерпілим"="RECONC",
                           "Справи закрито у зв’язку із зміною обстановки"="CIRCUMS",
                           "Справи закрито у зв’язку з передачею особи на поруки"="SPONS",
                           "Справи закрито у зв’язку з амністією"="AMNESTY",
                           "Справи закрито у зв’язку зі смертю"="DEATH",
                           "Справи закрито з інших підстав"="COTHER",
                           "Справи закрито оскільки існує вирок або ухвала про закриття кримінального провадження по тому самому обвинуваченню"="SAMEVERD",
                           "Справи закрито за відсутністю події, складу злочину чи недоведеністю обвинувачення"="CNOTCR",
                           "Справи закрито у зв’язку з відмовою прокурора або потерпілого, його представника від обвинувачення в кримінальному провадженні"="DENOPR",
                           #"Справи закрито у зв’язку із застосуванням примусових заходів виховного характеру до неповнолітнього"="CEDU",
                           "Застосовано покарання (разом)"="IMPTOT",
                           "Призначено довічне позбавлення волі"="LIFEIMP",
                           "Призначено позбавлення волі на певний строк"="IMP",
                           "Позбавлення волі строком 1 рік"="IMP1",
                           "Позбавлення волі строком понад 1 рік до 2 років включно"="IMP12",
                           "Позбавлення волі строком понад 2 роки до 3 років включно"="IMP23",
                           "Позбавлення волі строком понад 3 роки до 5 років включно"="IMP35",
                           "Позбавлення волі строком понад 5 років до 10 років включно"="IMP510",
                           "Позбавлення волі строком понад 10 років до 15 років включно"="IMP1015",
                           "Позбавлення волі строком понад 15 років до 25 років включно"="IMP1525",
                           "Призначено обмеження волі"="RESTOL",
                           "Призначено тримання в дисциплінарному батальйоні"="DISBAT",
                           "Призначено арешт"="ARREST",
                           "Призначено виправні роботи"="CORRW",
                           "Призначено службове обмеження для військовослужбовців"="SRVRSTR",
                           "Призначено громадські роботи"="PUBLW",
                           "Призначено штраф"="FINE",
                           "Призначено позбавлення права займати певні посади або займатися певною діяльністю"="DEPR",
                           "Звільнено від покарання (разом)"="RELTOT",
                           "Звільнено від покарання з випробуванням"="PROB",
                           "Звільнено від покарання унаслідок акта амністії"="RELAMN",
                           "Звільнено від покарання з інших підстав"="RELOTHR",
                           "Засуджено громадян України"="G2",
                           "Засуджено громадян іншої держави"="G3",
                           "Засуджено жінок"="G4",
                           "Засуджено за правопорушення, вчинені у складі групи"="G5",
                           "Засуджено за правопорушення, вчинені у складі організованої групи"="G6",
                           "Засуджено за правопорушення, вчинені у складі злочинної організації"="G7",
                           "Засуджено за правопорушення, вчинені стані алкогольного сп`яніння"="G8",
                           "Засуджено за правопорушення, вчинені стані наркотичного сп`яніння "="G9",
                           "Засуджено за правопорушення, вчинене у віці від 14 до 16 років "="G10",
                           "Засуджено за правопорушення, вчинене у віці від 16 до 18 років"="G11",
                           "Засуджено за правопорушення, вчинене у віці від 18 до 25 років"="G12",
                           "Засуджено за правопорушення, вчинене у віці від 25 до 30 років "="G13",
                           "Засуджено за правопорушення, вчинене у віці від 30 до 50 років"="G14",
                           "Засуджено за правопорушення, вчинене у віці від 50 до 65 років"="G15",
                           "Засуджено за правопорушення, вчинене у віці від 65 років і старше"="G16",
                           "Заняття засуджених на момент вчинення правопорушення - робітники"="G17",
                           "Заняття засуджених на момент вчинення правопорушення - державні службовці"="G18",
                           "Заняття засуджених на момент вчинення правопорушення - інші службовці"="G19",
                           "Заняття засуджених на момент вчинення правопорушення - військовослужбовці"="G20",
                           "Заняття засуджених на момент вчинення правопорушення - лікарі, фармацевти"="G21",
                           "Заняття засуджених на момент вчинення правопорушення - вчителі, викладачі "="G22",
                           "Заняття засуджених на момент вчинення правопорушення - працівники засобів масової інформації"="G23",
                           "Заняття засуджених на момент вчинення правопорушення - приватні підприємці"="G24",
                           "Заняття засуджених на момент вчинення правопорушення - працівники господарських товариств"="G25",
                           "Заняття засуджених на момент вчинення правопорушення - учні шкіл, ліцеїв, коледжів, гімназій"="G26",
                           "Заняття засуджених на момент вчинення правопорушення - студенти навчальних закладів"="G27",
                           "Заняття засуджених на момент вчинення правопорушення - інші заняття"="G28",
                           "Заняття засуджених на момент вчинення правопорушення - пенсіонери, у т.ч. інваліди"="G29",
                           "Заняття засуджених на момент вчинення правопорушення - безробітні"="G30",
                           "Заняття засуджених на момент вчинення правопорушення - працездатні, які не працювали і не навчалися "="G31",
                           "Засуджені працездатні, які не працювали і не навчалися, та мають незняту і непогашену судимість (з гр. 31)"="G32",
                           "Заняття засуджених на момент вчинення правопорушення - неповнолітні до 16 років, які не працювали і не навчалися"="G33",
                           "Заняття засуджених на момент вчинення правопорушення - утримувалися в установі виконання покарань, під вартою"="G34",
                           "Освіта на час вчинення правопорушення - повна вища"="G35",
                           "Освіта на час вчинення правопорушення - базова вища"="G36",
                           "Освіта на час вчинення правопорушення - професійнотехнічна"="G37",
                           "Освіта на час вчинення правопорушення - повна загальна середня"="G38",
                           "Освіта на час вчинення правопорушення - базова загальна середня"="G39",
                           "Освіта на час вчинення правопорушення - початкова загальна"="G40",
                           "Освіта на час вчинення правопорушення - без освіти"="G41",
                           "Засуджені, які раніше вчинили злочин, але були звільнені від кримінальної відповідальності"="G42",
                           "Засуджені, які судилися, але визнані такими, що не мають судимості"="G43",
                           "Засуджені, які судилися, але судимість погашена чи знята"="G44",
                           "Засуджені, які мають незняту і непогашену судимість"="G45",
                           "Засуджені, які мають одну судимість"="G46",
                           "Засуджені, які мають дві судимості"="G47",
                           "Засуджені, які мають три і більше судимостей"="G48",
                           "Засуджені, які мають судимість за правопорушення проти життя чи здоров’я особи"="G49",
                           "Засуджені, які мають судимість за правопорушення проти статевої свободи чи статевої недоторканості особи"="G50",
                           "Засуджені, які мають судимість за правопорушення проти власності"="G51",
                           "Засуджені, які мають судимість за правопорушення проти безпеки руху та есплуатації транспорту"="G52",
                           "Засуджені, які мають судимість за правопорушення проти громадського порядку, моральності"="G53",
                           "Засуджені, які мають судимість за правопорушення пов`язані з наркотиками"="G54",
                           "Засуджені, які мають судимість за інші кримінальні правопорушення "="G55",
                           "Засуджені, які мають судимість та відбули покарання повністю"="G56",
                           "Засуджені, які мають судимість та були звільнені від покарання (усього)"="G57",
                           "Засуджені, які мають судимість та були звільнені від покарання умовнодостроково"="G58",
                           "Засуджені, які мають судимість та були звільнені у зв’язку з амністією"="G59",
                           "Засуджені, які мають судимість та були звільнені від покарання з інших підстав"="G60",
                           "Засуджені, які мають судимість та скоїли злочин, не відбувши покарання (усього)"="G61",
                           "Засуджені, які мають судимість та скоїли злочин, не відбувши покарання у вигляді позбавлення чи обмеження волі або арешту"="G62",
                           "Засуджені, які мають судимість та скоїли злочин у період відбуття покарання в місцях позбавлення  чи обмеження волі або арешту"="G63",
                           "Засуджені, які мають судимість та учинили злочин у період іспитового сроку"="G64",
                           "Засуджені, які мають судимість та учинили злочин у період відбуття іншого покарання"="G65"
                         ),
                         selected = "ACC",
                         selectize = TRUE,
                         multiple = TRUE),
             
             
             checkboxInput("labelsYR", "Додати підписи значень"),
             br(),      
             br(),                               
             br(),      
             br(),                               
             br(),      
             br(),                               
             br(),      
             br(),
           ),
           
           
           mainPanel (
             HTML ("У даному розділі представлено відомості щодо загальних тенденцій кримінально-правового регулювання."),br(),
             HTML("Вхідні дані - звіти за період з 2013 по 2022 рік, 
                  розміщені на офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації."),br(),
             HTML ("Обробка даних здійснюється шляхом обчислення сумарних значень показників 
                   за розділами Особливої частини КК та за роками."),
             br(),
             HTML ("Отримані дані візуалізовано у вигляді абсолютних (візуалізація 1) та відносних (візуалізація 2) значень"), br(),
             fluidRow (downloadButton("download_cYR", "Завантажити візуалізацію 1"),
                       downloadButton("download_tab_cYR", "Завантажити дані (XLSX)")
                       ),
             plotOutput(outputId = "graph_cYR", height = "800px"),
            HTML("Представлення даних щодо обраних показників у відсотковому вигляді.
                 100% - сума значень визначеного показника для правопорушень, передбачених всіма розділами Особливої частини"),
            br(),
            fluidRow (downloadButton("download_P_YR", "Завантажити візуалізацію 2"),
                      downloadButton("download_tab_P_YR", "Завантажити дані (XLSX)"),
                      ),
                         plotOutput (outputId = "proc_graphYR", height = "800px")
           
           )
           
           
           
         )
),


tabPanel("Групові особливості",
         
         sidebarLayout(
           sidebarPanel(
  
             selectInput("ChapterCH", "Розділ Особливої частини КК:",
                         choices=chapter$chap,
                         selectize = TRUE,
                         multiple = FALSE,
                         selected =chapter$chap[1]),
                        
             selectInput(inputId = "fieldsCH_YR",
                         label = "Оберіть показники для дослідження:",
                         choices = c(
                           "Обліковано кримінальних правопорушень"="ACC",
                           "Кримінальні правопорушення, у яких особам вручено повідомлення про підозру"="SUSP",
                           "Проваджень скеровано до суду з обвинувальним актом"="INDICM",
                           "Проваджень скеровано до суду з клопотанням про звільнення від кримінальної відповідальності"="REL",
                           "Проваджень скеровано до суду з клопотанням про застосування примусових заходів медичного характеру"="MED",
                           "Проваджень скеровано до суду з клопотанням про застосування примусових заходів виховного характеру"="EDU",
                           "Проваджень скеровано до суду (разом)"="TOTPROV",
                           "Закінчені провадження щодо правопорушень, вчинених особами, які раніше вчиняли  кримінальні правопорушення"="RECID",
                           "Закінчені провадження щодо правопорушень, вчинених групою осіб"="GROUP",
                           "Закінчені провадження щодо правопорушень, вчинених особами у стані алкогольного сп'яніння"="INTOX",
                           "Закінчені провадження щодо правопорушень, вчинених неповнолітніми  або за їх  участю"="JUVEN",
                           "Осіб, вироки (постанови) щодо яких набрали законної сили"="CRTOT",
                           "Засуджено осіб"="CONVIC",
                           "Виправдано осіб"="ACQUIT",
                           "Неосудних, до яких застосовано примусові заходи медичного характеру"="CMED",
                           "Справи закрито (разом)"="CCLOSE",
                           "Справи закрито у зв’язку з дійовим каяттям"="CONFES",
                           "Справи закрито у зв’язку з примиренням винного з потерпілим"="RECONC",
                           "Справи закрито у зв’язку із зміною обстановки"="CIRCUMS",
                           "Справи закрито у зв’язку з передачею особи на поруки"="SPONS",
                           "Справи закрито у зв’язку з амністією"="AMNESTY",
                           "Справи закрито у зв’язку зі смертю"="DEATH",
                           "Справи закрито з інших підстав"="COTHER",
                           "Справи закрито оскільки існує вирок або ухвала про закриття кримінального провадження по тому самому обвинуваченню"="SAMEVERD",
                           "Справи закрито за відсутністю події, складу злочину чи недоведеністю обвинувачення"="CNOTCR",
                           "Справи закрито у зв’язку з відмовою прокурора або потерпілого, його представника від обвинувачення в кримінальному провадженні"="DENOPR",
                           #"Справи закрито у зв’язку із застосуванням примусових заходів виховного характеру до неповнолітнього"="CEDU",
                           "Застосовано покарання (разом)"="IMPTOT",
                           "Призначено довічне позбавлення волі"="LIFEIMP",
                           "Призначено позбавлення волі на певний строк"="IMP",
                           "Позбавлення волі строком 1 рік"="IMP1",
                           "Позбавлення волі строком понад 1 рік до 2 років включно"="IMP12",
                           "Позбавлення волі строком понад 2 роки до 3 років включно"="IMP23",
                           "Позбавлення волі строком понад 3 роки до 5 років включно"="IMP35",
                           "Позбавлення волі строком понад 5 років до 10 років включно"="IMP510",
                           "Позбавлення волі строком понад 10 років до 15 років включно"="IMP1015",
                           "Позбавлення волі строком понад 15 років до 25 років включно"="IMP1525",
                           "Призначено обмеження волі"="RESTOL",
                           "Призначено тримання в дисциплінарному батальйоні"="DISBAT",
                           "Призначено арешт"="ARREST",
                           "Призначено виправні роботи"="CORRW",
                           "Призначено службове обмеження для військовослужбовців"="SRVRSTR",
                           "Призначено громадські роботи"="PUBLW",
                           "Призначено штраф"="FINE",
                           "Призначено позбавлення права займати певні посади або займатися певною діяльністю"="DEPR",
                           "Звільнено від покарання (разом)"="RELTOT",
                           "Звільнено від покарання з випробуванням"="PROB",
                           "Звільнено від покарання унаслідок акта амністії"="RELAMN",
                           "Звільнено від покарання з інших підстав"="RELOTHR",
                           "Засуджено громадян України"="G2",
                           "Засуджено громадян іншої держави"="G3",
                           "Засуджено жінок"="G4",
                           "Засуджено за правопорушення, вчинені у складі групи"="G5",
                           "Засуджено за правопорушення, вчинені у складі організованої групи"="G6",
                           "Засуджено за правопорушення, вчинені у складі злочинної організації"="G7",
                           "Засуджено за правопорушення, вчинені стані алкогольного сп`яніння"="G8",
                           "Засуджено за правопорушення, вчинені стані наркотичного сп`яніння "="G9",
                           "Засуджено за правопорушення, вчинене у віці від 14 до 16 років "="G10",
                           "Засуджено за правопорушення, вчинене у віці від 16 до 18 років"="G11",
                           "Засуджено за правопорушення, вчинене у віці від 18 до 25 років"="G12",
                           "Засуджено за правопорушення, вчинене у віці від 25 до 30 років "="G13",
                           "Засуджено за правопорушення, вчинене у віці від 30 до 50 років"="G14",
                           "Засуджено за правопорушення, вчинене у віці від 50 до 65 років"="G15",
                           "Засуджено за правопорушення, вчинене у віці від 65 років і старше"="G16",
                           "Заняття засуджених на момент вчинення правопорушення - робітники"="G17",
                           "Заняття засуджених на момент вчинення правопорушення - державні службовці"="G18",
                           "Заняття засуджених на момент вчинення правопорушення - інші службовці"="G19",
                           "Заняття засуджених на момент вчинення правопорушення - військовослужбовці"="G20",
                           "Заняття засуджених на момент вчинення правопорушення - лікарі, фармацевти"="G21",
                           "Заняття засуджених на момент вчинення правопорушення - вчителі, викладачі "="G22",
                           "Заняття засуджених на момент вчинення правопорушення - працівники засобів масової інформації"="G23",
                           "Заняття засуджених на момент вчинення правопорушення - приватні підприємці"="G24",
                           "Заняття засуджених на момент вчинення правопорушення - працівники господарських товариств"="G25",
                           "Заняття засуджених на момент вчинення правопорушення - учні шкіл, ліцеїв, коледжів, гімназій"="G26",
                           "Заняття засуджених на момент вчинення правопорушення - студенти навчальних закладів"="G27",
                           "Заняття засуджених на момент вчинення правопорушення - інші заняття"="G28",
                           "Заняття засуджених на момент вчинення правопорушення - пенсіонери, у т.ч. інваліди"="G29",
                           "Заняття засуджених на момент вчинення правопорушення - безробітні"="G30",
                           "Заняття засуджених на момент вчинення правопорушення - працездатні, які не працювали і не навчалися "="G31",
                           "Засуджені працездатні, які не працювали і не навчалися, та мають незняту і непогашену судимість (з гр. 31)"="G32",
                           "Заняття засуджених на момент вчинення правопорушення - неповнолітні до 16 років, які не працювали і не навчалися"="G33",
                           "Заняття засуджених на момент вчинення правопорушення - утримувалися в установі виконання покарань, під вартою"="G34",
                           "Освіта на час вчинення правопорушення - повна вища"="G35",
                           "Освіта на час вчинення правопорушення - базова вища"="G36",
                           "Освіта на час вчинення правопорушення - професійнотехнічна"="G37",
                           "Освіта на час вчинення правопорушення - повна загальна середня"="G38",
                           "Освіта на час вчинення правопорушення - базова загальна середня"="G39",
                           "Освіта на час вчинення правопорушення - початкова загальна"="G40",
                           "Освіта на час вчинення правопорушення - без освіти"="G41",
                           "Засуджені, які раніше вчинили злочин, але були звільнені від кримінальної відповідальності"="G42",
                           "Засуджені, які судилися, але визнані такими, що не мають судимості"="G43",
                           "Засуджені, які судилися, але судимість погашена чи знята"="G44",
                           "Засуджені, які мають незняту і непогашену судимість"="G45",
                           "Засуджені, які мають одну судимість"="G46",
                           "Засуджені, які мають дві судимості"="G47",
                           "Засуджені, які мають три і більше судимостей"="G48",
                           "Засуджені, які мають судимість за правопорушення проти життя чи здоров’я особи"="G49",
                           "Засуджені, які мають судимість за правопорушення проти статевої свободи чи статевої недоторканості особи"="G50",
                           "Засуджені, які мають судимість за правопорушення проти власності"="G51",
                           "Засуджені, які мають судимість за правопорушення проти безпеки руху та есплуатації транспорту"="G52",
                           "Засуджені, які мають судимість за правопорушення проти громадського порядку, моральності"="G53",
                           "Засуджені, які мають судимість за правопорушення пов`язані з наркотиками"="G54",
                           "Засуджені, які мають судимість за інші кримінальні правопорушення "="G55",
                           "Засуджені, які мають судимість та відбули покарання повністю"="G56",
                           "Засуджені, які мають судимість та були звільнені від покарання (усього)"="G57",
                           "Засуджені, які мають судимість та були звільнені від покарання умовнодостроково"="G58",
                           "Засуджені, які мають судимість та були звільнені у зв’язку з амністією"="G59",
                           "Засуджені, які мають судимість та були звільнені від покарання з інших підстав"="G60",
                           "Засуджені, які мають судимість та скоїли злочин, не відбувши покарання (усього)"="G61",
                           "Засуджені, які мають судимість та скоїли злочин, не відбувши покарання у вигляді позбавлення чи обмеження волі або арешту"="G62",
                           "Засуджені, які мають судимість та скоїли злочин у період відбуття покарання в місцях позбавлення  чи обмеження волі або арешту"="G63",
                           "Засуджені, які мають судимість та учинили злочин у період іспитового сроку"="G64",
                           "Засуджені, які мають судимість та учинили злочин у період відбуття іншого покарання"="G65"
                         ),
                         selected = "ACC",
                         selectize = TRUE,
                         multiple = TRUE),
             
             
             checkboxInput("labelsCH_YR", "Додати підписи значень"),
             br(),      
             br(),                               
             br(),      
             br(),                               
             br(),      
             br(),                               
             br(),      
             br(),
           ),
           
           
           mainPanel (
             HTML("У даному розділі представлено відомості щодо особливостей кримінально-правового регулювання за окремими розділами
                  Особливої частини КК"),
             br(),
                  
            HTML("Вхідні дані - звіти за період з 2013 по 2022 рік, представлені на офіційних сайтах 
                 Офісу Генерального прокурора України та Державної судової адміністрації"),
             br(),
            HTML ("Дані систематизовано та візуалізовано за розділами та за роками, 
                  подано у вигляді абосолютних (візуалізація 1) та відносних (візуалізація 2) значень"), br(),
             fluidRow (downloadButton("download_cCH_YR", "Завантажити візуалізацію 1"),
                       downloadButton("download_tCH_YR", "Завантажити дані")),
             plotOutput(outputId = "graph_cCH_YR", height = "800px"),
             HTML("Представлення даних щодо обраних показників у відсотковому вигляді. 
                  100% - сума значень обраного показника для всіх статей визначеного розділу Особливої частини КК"),
             br(),
             fluidRow (downloadButton("download_P_CH_YR", "Завантажити візуалізацію 2"),
                       downloadButton("download_t_P_CH_YR", "Завантажити дані")),
             plotOutput (outputId = "proc_graphCHYR", height = "800px")
             
           )
           
           
           
         )
),


tabPanel("Окремі правопорушення",
         
         sidebarLayout(
           sidebarPanel(
             
             selectInput("ChapterART", "Розділ Особливої частини КК:",
                         choices=chapter$chap,
                         selectize = TRUE,
                         multiple = FALSE,
                         selected =chapter$chap[1]),
             
             uiOutput("articleART"),
             
             selectInput(inputId = "fieldsART",
                         label = "Оберіть показники для дослідження:",
                         choices = c(
                           "Осіб, вироки (постанови) щодо яких набрали законної сили"="CRTOT",
                           "Засуджено осіб"="CONVIC",
                           "Виправдано осіб"="ACQUIT",
                           "Неосудних, до яких застосовано примусові заходи медичного характеру"="CMED",
                           "Справи закрито (разом)"="CCLOSE",
                           "Справи закрито у зв’язку з дійовим каяттям"="CONFES",
                           "Справи закрито у зв’язку з примиренням винного з потерпілим"="RECONC",
                           "Справи закрито у зв’язку із зміною обстановки"="CIRCUMS",
                           "Справи закрито у зв’язку з передачею особи на поруки"="SPONS",
                           "Справи закрито у зв’язку з амністією"="AMNESTY",
                           "Справи закрито у зв’язку зі смертю"="DEATH",
                           "Справи закрито з інших підстав"="COTHER",
                           "Справи закрито оскільки існує вирок або ухвала про закриття кримінального провадження по тому самому обвинуваченню"="SAMEVERD",
                           "Справи закрито за відсутністю події, складу злочину чи недоведеністю обвинувачення"="CNOTCR",
                           "Справи закрито у зв’язку з відмовою прокурора або потерпілого, його представника від обвинувачення в кримінальному провадженні"="DENOPR",
                           #"Справи закрито у зв’язку із застосуванням примусових заходів виховного характеру до неповнолітнього"="CEDU",
                           "Застосовано покарання (разом)"="IMPTOT",
                           "Призначено довічне позбавлення волі"="LIFEIMP",
                           "Призначено позбавлення волі на певний строк"="IMP",
                           "Позбавлення волі строком 1 рік"="IMP1",
                           "Позбавлення волі строком понад 1 рік до 2 років включно"="IMP12",
                           "Позбавлення волі строком понад 2 роки до 3 років включно"="IMP23",
                           "Позбавлення волі строком понад 3 роки до 5 років включно"="IMP35",
                           "Позбавлення волі строком понад 5 років до 10 років включно"="IMP510",
                           "Позбавлення волі строком понад 10 років до 15 років включно"="IMP1015",
                           "Позбавлення волі строком понад 15 років до 25 років включно"="IMP1525",
                           "Призначено обмеження волі"="RESTOL",
                           "Призначено тримання в дисциплінарному батальйоні"="DISBAT",
                           "Призначено арешт"="ARREST",
                           "Призначено виправні роботи"="CORRW",
                           "Призначено службове обмеження для військовослужбовців"="SRVRSTR",
                           "Призначено громадські роботи"="PUBLW",
                           "Призначено штраф"="FINE",
                           "Призначено позбавлення права займати певні посади або займатися певною діяльністю"="DEPR",
                           "Звільнено від покарання (разом)"="RELTOT",
                           "Звільнено від покарання з випробуванням"="PROB",
                           "Звільнено від покарання унаслідок акта амністії"="RELAMN",
                           "Звільнено від покарання з інших підстав"="RELOTHR",
                           "Засуджено громадян України"="G2",
                           "Засуджено громадян іншої держави"="G3",
                           "Засуджено жінок"="G4",
                           "Засуджено за правопорушення, вчинені у складі групи"="G5",
                           "Засуджено за правопорушення, вчинені у складі організованої групи"="G6",
                           "Засуджено за правопорушення, вчинені у складі злочинної організації"="G7",
                           "Засуджено за правопорушення, вчинені стані алкогольного сп`яніння"="G8",
                           "Засуджено за правопорушення, вчинені стані наркотичного сп`яніння "="G9",
                           "Засуджено за правопорушення, вчинене у віці від 14 до 16 років "="G10",
                           "Засуджено за правопорушення, вчинене у віці від 16 до 18 років"="G11",
                           "Засуджено за правопорушення, вчинене у віці від 18 до 25 років"="G12",
                           "Засуджено за правопорушення, вчинене у віці від 25 до 30 років "="G13",
                           "Засуджено за правопорушення, вчинене у віці від 30 до 50 років"="G14",
                           "Засуджено за правопорушення, вчинене у віці від 50 до 65 років"="G15",
                           "Засуджено за правопорушення, вчинене у віці від 65 років і старше"="G16",
                           "Заняття засуджених на момент вчинення правопорушення - робітники"="G17",
                           "Заняття засуджених на момент вчинення правопорушення - державні службовці"="G18",
                           "Заняття засуджених на момент вчинення правопорушення - інші службовці"="G19",
                           "Заняття засуджених на момент вчинення правопорушення - військовослужбовці"="G20",
                           "Заняття засуджених на момент вчинення правопорушення - лікарі, фармацевти"="G21",
                           "Заняття засуджених на момент вчинення правопорушення - вчителі, викладачі "="G22",
                           "Заняття засуджених на момент вчинення правопорушення - працівники засобів масової інформації"="G23",
                           "Заняття засуджених на момент вчинення правопорушення - приватні підприємці"="G24",
                           "Заняття засуджених на момент вчинення правопорушення - працівники господарських товариств"="G25",
                           "Заняття засуджених на момент вчинення правопорушення - учні шкіл, ліцеїв, коледжів, гімназій"="G26",
                           "Заняття засуджених на момент вчинення правопорушення - студенти навчальних закладів"="G27",
                           "Заняття засуджених на момент вчинення правопорушення - інші заняття"="G28",
                           "Заняття засуджених на момент вчинення правопорушення - пенсіонери, у т.ч. інваліди"="G29",
                           "Заняття засуджених на момент вчинення правопорушення - безробітні"="G30",
                           "Заняття засуджених на момент вчинення правопорушення - працездатні, які не працювали і не навчалися "="G31",
                           "Засуджені працездатні, які не працювали і не навчалися, та мають незняту і непогашену судимість (з гр. 31)"="G32",
                           "Заняття засуджених на момент вчинення правопорушення - неповнолітні до 16 років, які не працювали і не навчалися"="G33",
                           "Заняття засуджених на момент вчинення правопорушення - утримувалися в установі виконання покарань, під вартою"="G34",
                           "Освіта на час вчинення правопорушення - повна вища"="G35",
                           "Освіта на час вчинення правопорушення - базова вища"="G36",
                           "Освіта на час вчинення правопорушення - професійнотехнічна"="G37",
                           "Освіта на час вчинення правопорушення - повна загальна середня"="G38",
                           "Освіта на час вчинення правопорушення - базова загальна середня"="G39",
                           "Освіта на час вчинення правопорушення - початкова загальна"="G40",
                           "Освіта на час вчинення правопорушення - без освіти"="G41",
                           "Засуджені, які раніше вчинили злочин, але були звільнені від кримінальної відповідальності"="G42",
                           "Засуджені, які судилися, але визнані такими, що не мають судимості"="G43",
                           "Засуджені, які судилися, але судимість погашена чи знята"="G44",
                           "Засуджені, які мають незняту і непогашену судимість"="G45",
                           "Засуджені, які мають одну судимість"="G46",
                           "Засуджені, які мають дві судимості"="G47",
                           "Засуджені, які мають три і більше судимостей"="G48",
                           "Засуджені, які мають судимість за правопорушення проти життя чи здоров’я особи"="G49",
                           "Засуджені, які мають судимість за правопорушення проти статевої свободи чи статевої недоторканості особи"="G50",
                           "Засуджені, які мають судимість за правопорушення проти власності"="G51",
                           "Засуджені, які мають судимість за правопорушення проти безпеки руху та есплуатації транспорту"="G52",
                           "Засуджені, які мають судимість за правопорушення проти громадського порядку, моральності"="G53",
                           "Засуджені, які мають судимість за правопорушення пов`язані з наркотиками"="G54",
                           "Засуджені, які мають судимість за інші кримінальні правопорушення "="G55",
                           "Засуджені, які мають судимість та відбули покарання повністю"="G56",
                           "Засуджені, які мають судимість та були звільнені від покарання (усього)"="G57",
                           "Засуджені, які мають судимість та були звільнені від покарання умовнодостроково"="G58",
                           "Засуджені, які мають судимість та були звільнені у зв’язку з амністією"="G59",
                           "Засуджені, які мають судимість та були звільнені від покарання з інших підстав"="G60",
                           "Засуджені, які мають судимість та скоїли злочин, не відбувши покарання (усього)"="G61",
                           "Засуджені, які мають судимість та скоїли злочин, не відбувши покарання у вигляді позбавлення чи обмеження волі або арешту"="G62",
                           "Засуджені, які мають судимість та скоїли злочин у період відбуття покарання в місцях позбавлення  чи обмеження волі або арешту"="G63",
                           "Засуджені, які мають судимість та учинили злочин у період іспитового сроку"="G64",
                           "Засуджені, які мають судимість та учинили злочин у період відбуття іншого покарання"="G65"
                         ),
                         selected = "CRTOT",
                         selectize = TRUE,
                         multiple = TRUE),
             
             checkboxInput("labelsART", "Додати підписи значень"),
             br(),      
             br(),                               
             br(),      
             br(),                               
             br(),      
             br(),                               
             br(),      
             br(),
           ),
           
           
           mainPanel (
             HTML("У даному розділі представлено відомості щодо особливостей кримінально-правового регулювання за окремими правопорушеннями, 
             передбаченими частинами статей Особливої частини КК"),
             br(),
             
             HTML("Вхідні дані - звіти за період з 2013 по 2022 рік, представлені на офіційному сайті 
                 Державної судової адміністрації. Дані у цьому розділі подаються по частинам статей Особливої частини.
                 Нажаль поки що дані Офісу Генерального Прокурора сисематизовано тільки за статтями, тому у цьому розділі довідника 
                 дані ОГП не представлені.
                  Для одночасної роботи з даними Офісу Генерального Прокурора 
                  та даними Державної судової адміністрації використовуйте КОНСТРУКТОР ВІЗУАЛІЗАЦІЙ"),
             br(),
             HTML ("Дані систематизовано та візуалізовано за частинами статей та за роками, 
                  подано у вигляді абосолютних (візуалізація 1) та відносних (візуалізація 2) значень"), br(),
             fluidRow (downloadButton("download_ART", "Завантажити візуалізацію 1"),
                       downloadButton("download_tART", "Завантажити дані")),
             plotOutput(outputId = "graph_ART"),
             HTML("Представлення даних щодо обраних показників у відсотковому вигляді. 
                  100% - сума значень обраного показника для всіх частин визначенної статті Особливої частини КК"),
             br(),
             fluidRow (downloadButton("download_P_ART", "Завантажити візуалізацію 2"),
                       downloadButton("download_t_P_ART", "Завантажити дані")),
             plotOutput (outputId = "proc_graph_ART")
             
           )
           
           
           
         )
),





    tabPanel("Конструктор візуалізацій",
             
             sidebarLayout(
               sidebarPanel(
               
                 selectInput(inputId = "fields",
                             label = "Оберіть показники для дослідження:",
                             choices = c(
                               "Обліковано кримінальних правопорушень"="ACC",
                               "Кримінальні правопорушення, у яких особам вручено повідомлення про підозру"="SUSP",
                               "Проваджень скеровано до суду з обвинувальним актом"="INDICM",
                               "Проваджень скеровано до суду з клопотанням про звільнення від кримінальної відповідальності"="REL",
                               "Проваджень скеровано до суду з клопотанням про застосування примусових заходів медичного характеру"="MED",
                               "Проваджень скеровано до суду з клопотанням про застосування примусових заходів виховного характеру"="EDU",
                               "Проваджень скеровано до суду (разом)"="TOTPROV",
                               "Закінчені провадження щодо правопорушень, вчинених особами, які раніше вчиняли  кримінальні правопорушення"="RECID",
                               "Закінчені провадження щодо правопорушень, вчинених групою осіб"="GROUP",
                               "Закінчені провадження щодо правопорушень, вчинених особами у стані алкогольного сп'яніння"="INTOX",
                               "Закінчені провадження щодо правопорушень, вчинених неповнолітніми  або за їх  участю"="JUVEN",
                               "Осіб, вироки (постанови) щодо яких набрали законної сили"="CRTOT",
                               "Засуджено осіб"="CONVIC",
                               "Виправдано осіб"="ACQUIT",
                               "Неосудних, до яких застосовано примусові заходи медичного характеру"="CMED",
                               "Справи закрито (разом)"="CCLOSE",
                               "Справи закрито у зв’язку з дійовим каяттям"="CONFES",
                               "Справи закрито у зв’язку з примиренням винного з потерпілим"="RECONC",
                               "Справи закрито у зв’язку із зміною обстановки"="CIRCUMS",
                               "Справи закрито у зв’язку з передачею особи на поруки"="SPONS",
                               "Справи закрито у зв’язку з амністією"="AMNESTY",
                               "Справи закрито у зв’язку зі смертю"="DEATH",
                               "Справи закрито з інших підстав"="COTHER",
                               "Справи закрито оскільки існує вирок або ухвала про закриття кримінального провадження по тому самому обвинуваченню"="SAMEVERD",
                               "Справи закрито за відсутністю події, складу злочину чи недоведеністю обвинувачення"="CNOTCR",
                               "Справи закрито у зв’язку з відмовою прокурора або потерпілого, його представника від обвинувачення в кримінальному провадженні"="DENOPR",
                               #"Справи закрито у зв’язку із застосуванням примусових заходів виховного характеру до неповнолітнього"="CEDU",
                               "Застосовано покарання (разом)"="IMPTOT",
                               "Призначено довічне позбавлення волі"="LIFEIMP",
                               "Призначено позбавлення волі на певний строк"="IMP",
                               "Позбавлення волі строком 1 рік"="IMP1",
                               "Позбавлення волі строком понад 1 рік до 2 років включно"="IMP12",
                               "Позбавлення волі строком понад 2 роки до 3 років включно"="IMP23",
                               "Позбавлення волі строком понад 3 роки до 5 років включно"="IMP35",
                               "Позбавлення волі строком понад 5 років до 10 років включно"="IMP510",
                               "Позбавлення волі строком понад 10 років до 15 років включно"="IMP1015",
                               "Позбавлення волі строком понад 15 років до 25 років включно"="IMP1525",
                               "Призначено обмеження волі"="RESTOL",
                               "Призначено тримання в дисциплінарному батальйоні"="DISBAT",
                               "Призначено арешт"="ARREST",
                               "Призначено виправні роботи"="CORRW",
                               "Призначено службове обмеження для військовослужбовців"="SRVRSTR",
                               "Призначено громадські роботи"="PUBLW",
                               "Призначено штраф"="FINE",
                               "Призначено позбавлення права займати певні посади або займатися певною діяльністю"="DEPR",
                               "Звільнено від покарання (разом)"="RELTOT",
                               "Звільнено від покарання з випробуванням"="PROB",
                               "Звільнено від покарання унаслідок акта амністії"="RELAMN",
                               "Звільнено від покарання з інших підстав"="RELOTHR",
                               "Засуджено громадян України"="G2",
                               "Засуджено громадян іншої держави"="G3",
                               "Засуджено жінок"="G4",
                               "Засуджено за правопорушення, вчинені у складі групи"="G5",
                               "Засуджено за правопорушення, вчинені у складі організованої групи"="G6",
                               "Засуджено за правопорушення, вчинені у складі злочинної організації"="G7",
                               "Засуджено за правопорушення, вчинені стані алкогольного сп`яніння"="G8",
                               "Засуджено за правопорушення, вчинені стані наркотичного сп`яніння "="G9",
                               "Засуджено за правопорушення, вчинене у віці від 14 до 16 років "="G10",
                               "Засуджено за правопорушення, вчинене у віці від 16 до 18 років"="G11",
                               "Засуджено за правопорушення, вчинене у віці від 18 до 25 років"="G12",
                               "Засуджено за правопорушення, вчинене у віці від 25 до 30 років "="G13",
                               "Засуджено за правопорушення, вчинене у віці від 30 до 50 років"="G14",
                               "Засуджено за правопорушення, вчинене у віці від 50 до 65 років"="G15",
                               "Засуджено за правопорушення, вчинене у віці від 65 років і старше"="G16",
                               "Заняття засуджених на момент вчинення правопорушення - робітники"="G17",
                               "Заняття засуджених на момент вчинення правопорушення - державні службовці"="G18",
                               "Заняття засуджених на момент вчинення правопорушення - інші службовці"="G19",
                               "Заняття засуджених на момент вчинення правопорушення - військовослужбовці"="G20",
                               "Заняття засуджених на момент вчинення правопорушення - лікарі, фармацевти"="G21",
                               "Заняття засуджених на момент вчинення правопорушення - вчителі, викладачі "="G22",
                               "Заняття засуджених на момент вчинення правопорушення - працівники засобів масової інформації"="G23",
                               "Заняття засуджених на момент вчинення правопорушення - приватні підприємці"="G24",
                               "Заняття засуджених на момент вчинення правопорушення - працівники господарських товариств"="G25",
                               "Заняття засуджених на момент вчинення правопорушення - учні шкіл, ліцеїв, коледжів, гімназій"="G26",
                               "Заняття засуджених на момент вчинення правопорушення - студенти навчальних закладів"="G27",
                               "Заняття засуджених на момент вчинення правопорушення - інші заняття"="G28",
                               "Заняття засуджених на момент вчинення правопорушення - пенсіонери, у т.ч. інваліди"="G29",
                               "Заняття засуджених на момент вчинення правопорушення - безробітні"="G30",
                               "Заняття засуджених на момент вчинення правопорушення - працездатні, які не працювали і не навчалися "="G31",
                               "Засуджені працездатні, які не працювали і не навчалися, та мають незняту і непогашену судимість (з гр. 31)"="G32",
                               "Заняття засуджених на момент вчинення правопорушення - неповнолітні до 16 років, які не працювали і не навчалися"="G33",
                               "Заняття засуджених на момент вчинення правопорушення - утримувалися в установі виконання покарань, під вартою"="G34",
                               "Освіта на час вчинення правопорушення - повна вища"="G35",
                               "Освіта на час вчинення правопорушення - базова вища"="G36",
                               "Освіта на час вчинення правопорушення - професійнотехнічна"="G37",
                               "Освіта на час вчинення правопорушення - повна загальна середня"="G38",
                               "Освіта на час вчинення правопорушення - базова загальна середня"="G39",
                               "Освіта на час вчинення правопорушення - початкова загальна"="G40",
                               "Освіта на час вчинення правопорушення - без освіти"="G41",
                               "Засуджені, які раніше вчинили злочин, але були звільнені від кримінальної відповідальності"="G42",
                               "Засуджені, які судилися, але визнані такими, що не мають судимості"="G43",
                               "Засуджені, які судилися, але судимість погашена чи знята"="G44",
                               "Засуджені, які мають незняту і непогашену судимість"="G45",
                               "Засуджені, які мають одну судимість"="G46",
                               "Засуджені, які мають дві судимості"="G47",
                               "Засуджені, які мають три і більше судимостей"="G48",
                               "Засуджені, які мають судимість за правопорушення проти життя чи здоров’я особи"="G49",
                               "Засуджені, які мають судимість за правопорушення проти статевої свободи чи статевої недоторканості особи"="G50",
                               "Засуджені, які мають судимість за правопорушення проти власності"="G51",
                               "Засуджені, які мають судимість за правопорушення проти безпеки руху та есплуатації транспорту"="G52",
                               "Засуджені, які мають судимість за правопорушення проти громадського порядку, моральності"="G53",
                               "Засуджені, які мають судимість за правопорушення пов`язані з наркотиками"="G54",
                               "Засуджені, які мають судимість за інші кримінальні правопорушення "="G55",
                               "Засуджені, які мають судимість та відбули покарання повністю"="G56",
                               "Засуджені, які мають судимість та були звільнені від покарання (усього)"="G57",
                               "Засуджені, які мають судимість та були звільнені від покарання умовнодостроково"="G58",
                               "Засуджені, які мають судимість та були звільнені у зв’язку з амністією"="G59",
                               "Засуджені, які мають судимість та були звільнені від покарання з інших підстав"="G60",
                               "Засуджені, які мають судимість та скоїли злочин, не відбувши покарання (усього)"="G61",
                               "Засуджені, які мають судимість та скоїли злочин, не відбувши покарання у вигляді позбавлення чи обмеження волі або арешту"="G62",
                               "Засуджені, які мають судимість та скоїли злочин у період відбуття покарання в місцях позбавлення  чи обмеження волі або арешту"="G63",
                               "Засуджені, які мають судимість та учинили злочин у період іспитового сроку"="G64",
                               "Засуджені, які мають судимість та учинили злочин у період відбуття іншого покарання"="G65"
                                         ),
                             selected = "ACC",
                             selectize = TRUE,
                             multiple = TRUE),
                 
               
                 checkboxInput("labels", "Додати підписи значень"),
                 
                 checkboxInput("DefYear","Обрати період часу"),
                 conditionalPanel(condition = "input.DefYear",           
                                  sliderInput("Rik",
                                              "Роки:",
                                              min = 2013,
                                              max = 2022,
                                              value = c(2013,2022))),
                 
                 checkboxInput("DefChap","Обрати розділ Особливої частини КК"),
                 conditionalPanel(condition = "input.DefChap==true",
                                  uiOutput("DefChapOut"),
                                  fluidRow(actionButton ("all_CH","Обрати всі Розділи",width = "49.5%"),
                                           actionButton ("dis_CH","Скасувати вибір",width = "49.5%")),
                               br(),      
                               br()),
              
                 
                
                  checkboxInput("DefArt","Обрати статтю Особливої частини КК"),
                 conditionalPanel(condition = "input.DefArt==true",
                                  uiOutput("articleK"),
                                  fluidRow(actionButton ("all_Art","Обрати всі статті",width = "49.5%"),
                                           actionButton ("dis_Art","Скасувати вибір",width = "49.5%")),
                                                           
                                  
                                  ),
                 
                 
                 uiOutput ("vidsotkova"),
                 uiOutput("DefBase"),
                 br(),      
                 br(),                               
                 br(),      
                 br(),                               
                 br(),      
                 br(),                               
                 br(),      
                 br(),
               ),
               
             
             mainPanel (
               HTML("Візуалізації та набори даних створюються на підставі звітів за період з 2013 по 2022 рік, представлених на офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації"),
               br(),
               downloadButton("download_c", "Завантажити візуалізацію"),
               plotOutput(outputId = "graph_c"),
               #textOutput("control"),
               textOutput("control2"),
               uiOutput ("Perc_g_but"),
               plotOutput (outputId = "proc_graph")
               
             )
             
             
             
             )
             ),
    
    
    tabPanel ("Дані конструктора візуалізацій",
              HTML ("Сформований набір даних"),
              br(),
              downloadButton("download_table", "Завантажити набір даних (XLSX)"),
              DT::dataTableOutput(outputId = "construct"),
              #"Сформований набір даних"
              uiOutput ("Perc_t"),
              br(),
              uiOutput ("Perc_but"),
              DT::dataTableOutput(outputId = "Perc"),
                             
              
              
              
              )   
              
              )
    
    
    
    
    




server <- function(input, output,session) {



  
  
  
  #_______________________________________KONSTRUKT
  
  output$DefChapOut<-renderUI({
  selectInput("ChapterK", "Розділ Особливої частини КК:",
              choices=chapter$chap,
              selectize = TRUE,
              multiple = TRUE,
              selected =chapter$chap[1])
    })
  
  observeEvent(input$all_CH,{
    updateSelectInput(session, "ChapterK",
                      choices=chapter$chap,
                      selected =chapter$chap)
  })
  
  observeEvent(input$dis_CH,{
    updateSelectInput(session, "ChapterK",
                      choices=chapter$chap,
                      selected =NULL)
  })
  
  
  constr_ch<-reactive({if (input$DefChap) chapter$chn[chapter$chap %in% input$ChapterK] else chapter$chn})
  constr_art<-reactive({if (input$DefArt) 
    articles$header[articles$chapt %in% constr_ch()]
         })
  
  output$articleK<-renderUI ({
       
         selectInput("art_chK", "Стаття:",
                choices = constr_art(),
                selectize = TRUE,
                multiple = TRUE,
         selected = constr_art()[1]
         )
  })
  
  observeEvent(input$all_Art,{
    updateSelectInput(session, "art_chK",
                      choices=constr_art(),
                      selected =constr_art())
  })
  
  observeEvent(input$dis_Art,{
    updateSelectInput(session, "art_chK",
                      choices=constr_art(),
                      selected =NULL)
  })
  
  
  
  staloR<-reactive({rule%>%select(input$fields)%>%filter(row_number()==1)})
    
  fieldsT<-reactive({
    if (!input$DefYear&!input$DefChap&!input$DefArt)
      {unlist(staloR())} else
        if (!input$DefYear&input$DefChap&!input$DefArt) 
          {c("Розділ","Назва розділу",unlist(staloR()))}else
            if (!input$DefYear&input$DefArt)
              {c("Стаття","Назва статті", unlist(staloR()))}else
                if (input$DefYear&!input$DefChap&!input$DefArt) 
                  {c("Рік", unlist(staloR()))}else  
                    if (input$DefYear&input$DefChap&!input$DefArt)     
                      {c("Рік","Розділ","Назва розділу", unlist(staloR()))}else  
                        if (input$DefYear&input$DefArt)  
                          {c("Рік","Стаття", "Назва статті",unlist(staloR()))}  
                            })
  fieldsT2<-reactive({
    if (!input$DefYear&!input$DefChap&!input$DefArt)
    {unlist(staloR())} else
      if (!input$DefYear&input$DefChap&!input$DefArt) 
      {c("ChapterR", unlist(staloR()))}else
        if (!input$DefYear&input$DefArt)
        {c("Article", unlist(staloR()))}else
          if (input$DefYear&!input$DefChap&!input$DefArt) 
          {c("Year", unlist(staloR()))}else  
            if (input$DefYear&input$DefChap&!input$DefArt)     
            {c("Year","ChapterR", unlist(staloR()))}else  
              if (input$DefYear&input$DefArt)  
              {c("Year","Article", unlist(staloR()))}  
                })
  
  resultc <- reactive({
    
    if (!input$DefYear&!input$DefChap&!input$DefArt) 
      {crimes%>%select(input$fields)%>%
      summarise_if(is.numeric,sum)%>%setNames(fieldsT())} else
    
        if (!input$DefYear&input$DefChap&!input$DefArt) 
      {crimes%>%select(1:5,ChapterR,input$fields)%>%
      filter(ChapterTXT %in% input$ChapterK)%>%
      select(ChapterR,ChapterTXT,input$fields)%>%
      group_by(ChapterR,ChapterTXT)%>%
      summarise_if(is.numeric,sum)%>%setNames(fieldsT())} else
        
        if (!input$DefYear&input$DefArt) 
        {crimes%>%select(1:4,input$fields)%>%
            filter(nazva %in% input$art_chK)%>%
            select(Article,nazva,input$fields)%>%
            group_by(Article,nazva)%>%
            summarise_if(is.numeric,sum)%>%setNames(fieldsT())}else
        
        if (input$DefYear&!input$DefChap&!input$DefArt) 
        {crimes%>%select(Year,input$fields)%>%
            filter((Year>=input$Rik[1])&(Year<=input$Rik[2]))%>%
            group_by(Year)%>%
        summarise_if(is.numeric,sum)%>%setNames(fieldsT())} else
        
        if (input$DefYear&input$DefChap&!input$DefArt) 
                    {crimes%>%select(1:5,ChapterR,input$fields)%>%
                        filter(ChapterTXT %in% input$ChapterK)%>%
            filter((Year>=input$Rik[1])&(Year<=input$Rik[2]))%>%
                        select(Year,ChapterR,ChapterTXT,input$fields)%>%
                        group_by(Year, ChapterR, ChapterTXT)%>%
                        summarise_if(is.numeric,sum)%>%setNames(fieldsT())} else
        if (input$DefYear&input$DefArt) 
          {crimes%>%select(1:4,input$fields)%>%
            filter(nazva %in% input$art_chK)%>%
            filter((Year>=input$Rik[1])&(Year<=input$Rik[2]))%>%
            select(Year,Article,nazva,input$fields)%>%
                              group_by(Year,Article,nazva)%>%
                              summarise_if(is.numeric,sum)%>%setNames(fieldsT())}       
              
              
              
  })
  
  
  
  resultc2 <- reactive({
    
    if (!input$DefYear&!input$DefChap&!input$DefArt) 
    {crimes%>%select(input$fields)%>%
        summarise_if(is.numeric,sum)%>%setNames(fieldsT2())%>%
        as.data.frame%>%reshape(timevar = "Comment", 
              times=fieldsT(), 
              v.names = "QNT", 
              varying = fieldsT(), 
              direction = "long")
        
        } else
          
          if (!input$DefYear&input$DefChap&!input$DefArt) 
          {req (input$ChapterK)
                crimes%>%select(1:5,input$fields,ChapterR)%>%
              filter(ChapterTXT %in% input$ChapterK)%>%
              select(ChapterR,input$fields)%>%
              group_by(ChapterR)%>%
              summarise_if(is.numeric,sum)%>%
            setNames(fieldsT2())%>%
             as.data.frame()%>%
               reshape(timevar = "Comment", 
                      times=fieldsT2()[2:length(fieldsT2())],
                      v.names = "QNT", 
                      varying=fieldsT2()[2:length(fieldsT2())],
                      direction = "long")
            } else
                
                if (!input$DefYear&input$DefArt) 
                {req (input$art_chK)
                  crimes%>%select(1:4,input$fields)%>%
                    filter(nazva %in% input$art_chK)%>%
                    select(Article,input$fields)%>%
                    group_by(Article)%>%
                    summarise_if(is.numeric,sum)%>%
                  setNames(fieldsT2())%>%
                    as.data.frame()%>%
                    reshape(timevar = "Comment", 
                            times=fieldsT2()[2:length(fieldsT2())],
                            v.names = "QNT", 
                            varying=fieldsT2()[2:length(fieldsT2())],
                            direction = "long")
                  
                  
                  }else
                      
                      if (input$DefYear&!input$DefChap&!input$DefArt) 
                      {req (input$Rik)
                        crimes%>%select(Year,input$fields)%>%
                          filter((Year>=input$Rik[1])&(Year<=input$Rik[2]))%>%
                          group_by(Year)%>%
                          summarise_if(is.numeric,sum)%>%
                        setNames(fieldsT2())%>%
                          as.data.frame()%>%
                          reshape(timevar = "Comment", 
                                  times=fieldsT2()[2:length(fieldsT2())],
                                  v.names = "QNT", 
                                  varying=fieldsT2()[2:length(fieldsT2())],
                                  direction = "long")
                        
                        
                        
                        
                        
                        } else
                            
                            if (input$DefYear&input$DefChap&!input$DefArt) 
                            {req (input$Rik)
                              req (input$ChapterK)
                              crimes%>%select(1:5,input$fields,ChapterR)%>%
                                filter(ChapterTXT %in% input$ChapterK)%>%
                                filter((Year>=input$Rik[1])&(Year<=input$Rik[2]))%>%
                                select(Year,ChapterR,input$fields)%>%
                                group_by(Year, ChapterR)%>%
                                summarise_if(is.numeric,sum)%>%
                                setNames(fieldsT2())%>%
                                as.data.frame()%>%
                                reshape(timevar = "Comment", 
                                        times=fieldsT2()[3:length(fieldsT2())],
                                        v.names = "QNT", 
                                        varying=fieldsT2()[3:length(fieldsT2())],
                                        direction = "long")
                              
                              } 
    
    
    else
      if (input$DefYear&input$DefArt) 
                                  {req (input$Rik)
        req (input$art_chK)
        crimes%>%select(1:4,input$fields)%>%
                                      filter(nazva %in% input$art_chK)%>%
                                      filter((Year>=input$Rik[1])&(Year<=input$Rik[2]))%>%
                                      select(Year,Article,input$fields)%>%
                                      group_by(Year,Article)%>%
                                      summarise_if(is.numeric,sum)%>%
          setNames(fieldsT2())%>%
          as.data.frame()%>%
          reshape(timevar = "Comment", 
                  times=fieldsT2()[3:length(fieldsT2())],
                  v.names = "QNT", 
                  varying=fieldsT2()[3:length(fieldsT2())],
                  direction = "long")
        
          }       
    
    
    
  })
  
  
  output$construct <- DT::renderDataTable({
    DT::datatable(resultc(), filter = "top")})
  
  output$download_table <- downloadHandler(
    filename = function() 
    {
      paste("karchevskyi-table-",format(Sys.Date(),"%d-%m-%Y"),".xlsx",sep = "")},
    content=function(file){
      
      write.xlsx(resultc(),file)}
  )
  

  plot1_1<-reactive({if(input$labels&!input$DefYear) 
  {plot1()+geom_text(aes(angle=90,y=max(resultc2()$QNT/2)))}
    else 
      if (input$labels&input$DefYear) {plot1()+geom_label(nudge_y = 0.01)}
    else {plot1()}
    
    
  })
  
  output$graph_c<-renderPlot(plot1_1())
  
  
  
  
  
  
  plot1<-reactive ({
    if (!input$DefYear&!input$DefChap&!input$DefArt) {
    ggplot(data = resultc2(), 
           aes( x = factor(Comment,levels = fieldsT2()),
                y = QNT, label=QNT,
                fill = factor(Comment,levels = fieldsT2()))) +
      geom_bar(stat = "identity")+ylab("абсолютні значення")+
        scale_y_continuous(labels = point)+
        theme(axis.title.x = element_blank(),
              axis.ticks.x = element_blank(),
              axis.text.x = element_blank(),
              legend.title=element_blank())
        } 
    else if (!input$DefYear&input$DefChap&!input$DefArt) 
    {
      ggplot(data = resultc2(), 
             aes( x = factor(Comment,levels = fieldsT2()),y = QNT, 
                  label=QNT,fill = factor(Comment,levels = fieldsT2()))) +
        scale_y_continuous(labels = point)+
        geom_bar(stat = "identity")+ylab("абсолютні значення")+
        facet_wrap (.~factor(ChapterR, 
                             levels=chapter_label), 
                    ncol=4)+
        theme(axis.title.x = element_blank(),
              axis.text.x = element_blank(),
              axis.ticks.x = element_blank(),
              legend.title=element_blank())
      }
      
    else if (!input$DefYear&input$DefArt) 
    {
      ggplot(data = resultc2(), 
             aes( x = factor(Comment,levels = fieldsT2()),y = QNT, label=QNT,
                  fill = factor(Comment,levels = fieldsT2()))) +
        facet_wrap (.~factor(Article), 
                    ncol=4)+
        scale_y_continuous(labels = point)+
        geom_bar(stat = "identity")+ylab("абсолютні значення")+
        theme(axis.title.x = element_blank(),
              axis.text.x = element_blank(),
              axis.ticks.x = element_blank(),
              legend.title=element_blank())
      }
    
    else if (input$DefYear&!input$DefChap&!input$DefArt)
    {
      ggplot (data = resultc2(),
              aes (x=factor(Year), y = QNT, label=QNT,
                   color=factor(Comment,levels = fieldsT2())))+
        scale_y_continuous(labels = point)+ylab("абсолютні значення")+
        geom_point()+geom_line(aes(group=Comment))+
        theme(axis.title.x = element_blank(),
              legend.title=element_blank())
    }
    
    else if (input$DefYear&input$DefChap&!input$DefArt)
    {
      ggplot (data = resultc2(),
              aes (x=factor(Year), y = QNT, label=QNT,
                   color=factor(Comment,levels = fieldsT2())))+
        scale_y_continuous(labels = point)+ylab("абсолютні значення")+
        geom_point()+geom_line(aes(group=Comment))+
        facet_wrap (.~factor(ChapterR, 
                             levels=chapter_label), 
                    ncol=4)+
        theme(axis.title.x = element_blank(),
              legend.title=element_blank(),
              axis.text.x=element_text(angle = 90))
    }
    
    else if (input$DefYear&input$DefArt)
    {
      ggplot (data = resultc2(),
              aes (x=factor(Year), y = QNT, label=QNT,
                   color=factor(Comment,levels = fieldsT())))+
        scale_y_continuous(labels = point)+ylab("абсолютні значення")+
        geom_point()+geom_line(aes(group=Comment))+
        facet_wrap (.~factor(Article), 
                    ncol=4)+
        theme(axis.title.x = element_blank(),
              legend.title=element_blank(),
              axis.text.x=element_text(angle = 90))
    }
    
    })

  
  
  output$download_c <- downloadHandler(
    filename = function() 
    {
      paste ("construct-",format(Sys.Date(),"%d-%m-%Y"),".png")
    },
    content=function(file)
    {
      ggsave (filename= file, plot=plot1_1()+
                ggtitle(
"Візуалізація на підставі звітів за період з 2013 по 2022 рік, представлених на 
офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації.
Створено у веб-застосунку - Карчевський М. В. Протидія злочинності в Україні: інфографіка : інтерактивний довідник.",
subtitle = paste("URL :https://karchevskiy.org/i-dovidnyk/ (дата звернення :",format(Sys.Date(),"%d.%m.%Y"),")")),
              device="png",
              width = 16, height = 9, dpi = 300, units = "in" )
    }
  )  
  
  
  
  
  
  
  
  
  
  
  
  
  
  output$vidsotkova<-renderUI({
    if (length(input$fields)>1)
    {checkboxInput("percent","Додати візуалізацію з відносними значеннями")}
  })
  
  output$DefBase<-renderUI({req(input$percent)    
    
    if (input$percent)
      {selectInput("base","Оберіть базову перемінну",
                  choices=unique(resultc2()$Comment))}
      
    
    }) 
  
  #---------------------------------------NEW DEF OF REACTIVE FOR GRAPH_Percentage
  
  
  baseR<-reactive({unlist(resultc()[input$base])})


 resultP<-reactive(
   {
     
     req(input$percent)
   req(input$base)
   
   
   if (!input$DefYear&!input$DefChap&!input$DefArt)
   {round(resultc()[ ,1:ncol(resultc())]/baseR()*100,1)} else
     if (!input$DefYear&input$DefChap&!input$DefArt) 
     {cbind(resultc()[ ,1:2],round(resultc()[ ,3:ncol(resultc())]/baseR()*100,1))}else
       if (!input$DefYear&input$DefArt)
       {cbind(resultc()[ ,1:2],round(resultc()[ ,3:ncol(resultc())]/baseR()*100,1))}else
         if (input$DefYear&!input$DefChap&!input$DefArt) 
         {cbind(resultc()[ ,1],round(resultc()[ ,2:ncol(resultc())]/baseR()*100,1))}else  
           if (input$DefYear&input$DefChap&!input$DefArt)     
           {cbind(resultc()[ ,1:3],round(resultc()[ ,4:ncol(resultc())]/baseR()*100,1))}else  
             if (input$DefYear&input$DefArt)  
             {cbind(resultc()[, 1:3],round(resultc()[ ,4:ncol(resultc())]/baseR()*100,1))}  
   }
   

   ) 
 
 


 
 #Percentage table
 
 output$Perc <- DT::renderDataTable({
   DT::datatable(resultP(),filter = "top")})
 


 
 output$download_tableP <- downloadHandler(
   filename = function() 
   {
     paste("karchevskyi-Ptable-",format(Sys.Date(),"%d-%m-%Y"),".xlsx",sep = "")},
   content=function(file){
     
     write.xlsx(resultP(),file)}
 )
 
 
 output$Perc_t<-renderText({req(input$percent)
   if (input$percent)
     HTML ("Відсотокове представлення сформованого набору даних відповідно до визначеної базової перемінної")})
 
 output$Perc_but<-renderUI({req(input$percent)
   if (input$percent)
     downloadButton("download_tableP", "Завантажити відсоткове представлення (XLSX)")})
 

 output$Perc_g_but<-renderUI({req(input$percent)
   if (input$percent)
     downloadButton("Perc_g_but2", "Завантажити візуалізацію з відсотковим представленням")})
 
 output$Perc_g_but2<- downloadHandler(
   filename = function() 
   {
     paste ("constructP-",format(Sys.Date(),"%d-%m-%Y"),".png")
   },
   content=function(file)
   {
     ggsave (filename= file, plot=plot2_1()+
               ggtitle(
                 "Візуалізація на підставі звітів за період з 2013 по 2022 рік, представлених на 
офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації.
Створено у веб-застосунку - Карчевський М. В. Протидія злочинності в Україні: інфографіка : інтерактивний довідник.",
                 subtitle = paste("URL :https://karchevskiy.org/i-dovidnyk/ (дата звернення :",format(Sys.Date(),"%d.%m.%Y"),")")),
             device="png",
             width = 16, height = 9, dpi = 300, units = "in" )
   }
 )  

 
 fieldsT3<-reactive({
   if (!input$DefYear&!input$DefChap&!input$DefArt)
   {unlist(staloR())} else
     if (!input$DefYear&input$DefChap&!input$DefArt) 
     {c("ChapterR", "ChapterTXT", unlist(staloR()))}else
       if (!input$DefYear&input$DefArt)
       {c("Article","nazva", unlist(staloR()))}else
         if (input$DefYear&!input$DefChap&!input$DefArt) 
         {c("Year", unlist(staloR()))}else  
           if (input$DefYear&input$DefChap&!input$DefArt)     
           {c("Year","ChapterR", "ChapterTXT",unlist(staloR()))}else  
             if (input$DefYear&input$DefArt)  
             {c("Year","Article", "nazva",unlist(staloR()))}  
 })
 
 
 
 
 resultc2P_1 <- reactive({req (input$percent)
   
   if (!input$DefYear&!input$DefChap&!input$DefArt) 
   {resultP()%>%setNames(fieldsT3())%>%
       as.data.frame%>%reshape(timevar = "Comment", 
                               times=fieldsT(), 
                               v.names = "QNT", 
                               varying = fieldsT(), 
                               direction = "long")%>%filter(!is.na(QNT))
     
   } else
     
     if (!input$DefYear&input$DefChap&!input$DefArt) 
     {req (input$ChapterK)
       resultP()%>%
         setNames(fieldsT3())%>%
         as.data.frame()%>%
         reshape(timevar = "Comment", 
                 times=fieldsT3()[3:length(fieldsT3())],
                 v.names = "QNT", 
                 varying=fieldsT3()[3:length(fieldsT3())],
                 direction = "long")%>%filter(!is.na(QNT))
     } else
       
       if (!input$DefYear&input$DefArt) 
       {req (input$art_chK)
         resultP()%>%
           setNames(fieldsT3())%>%
           as.data.frame()%>%
           reshape(timevar = "Comment", 
                   times=fieldsT3()[3:length(fieldsT3())],
                   v.names = "QNT", 
                   varying=fieldsT3()[3:length(fieldsT3())],
                   direction = "long")%>%filter(!is.na(QNT))
         
         
       }else
         
         if (input$DefYear&!input$DefChap&!input$DefArt) 
         {req (input$Rik)
           resultP()%>%
             setNames(fieldsT3())%>%
             as.data.frame()%>%
             reshape(timevar = "Comment", 
                     times=fieldsT3()[2:length(fieldsT3())],
                     v.names = "QNT", 
                     varying=fieldsT3()[2:length(fieldsT3())],
                     direction = "long")%>%filter(!is.na(QNT))
           
           
           
           
           
         } else
           
           if (input$DefYear&input$DefChap&!input$DefArt) 
           {req (input$Rik)
             req (input$ChapterK)
             resultP()%>%
               setNames(fieldsT3())%>%
               as.data.frame()%>%
               reshape(timevar = "Comment", 
                       times=fieldsT3()[4:length(fieldsT3())],
                       v.names = "QNT", 
                       varying=fieldsT3()[4:length(fieldsT3())],
                       direction = "long")%>%filter(!is.na(QNT))
             
           } 
   
   
   else
     if (input$DefYear&input$DefArt) 
     {req (input$Rik)
       req (input$art_chK)
       resultP()%>%
         setNames(fieldsT3())%>%
         as.data.frame()%>%
         reshape(timevar = "Comment", 
                 times=fieldsT3()[4:length(fieldsT3())],
                 v.names = "QNT", 
                 varying=fieldsT3()[4:length(fieldsT3())],
                 direction = "long")%>%filter(!is.na(QNT))
       
     }       
   
   
   
 })
 
 
 
 plot2_1<-reactive(
   if(input$labels&!input$DefYear) 
 {plot2()+geom_text(aes(angle=90,y=max(resultc2P_1()$QNT/2)))}
   else 
     if (input$labels&input$DefYear) {plot2()+geom_label(nudge_y = 0.01)}
   else {plot2()}
   
   
 )
 

 output$proc_graph<-renderPlot(
   
   plot2_1()
   
   )
 
 
 plot2<-reactive ({
   if (!input$DefYear&!input$DefChap&!input$DefArt) {
     ggplot(data = resultc2P_1(), 
            aes( x = factor(Comment,levels = fieldsT2()),
                 y = QNT, label=QNT,
                 fill = factor(Comment,levels = fieldsT2()))) +
       geom_bar(stat = "identity")+ylab("відносні значення (%)")+
       scale_y_continuous(labels = point)+
       theme(axis.title.x = element_blank(),
             axis.ticks.x = element_blank(),
             axis.text.x = element_blank(),
             legend.title=element_blank())
   } 
   else if (!input$DefYear&input$DefChap&!input$DefArt) 
   {
     ggplot(data = resultc2P_1(), 
            aes( x = factor(Comment,levels = fieldsT2()),y = QNT, label=QNT,
                 fill = factor(Comment,levels = fieldsT2()))) +
       scale_y_continuous(labels = point)+
       geom_bar(stat = "identity")+ylab("відносні значення (%)")+
       facet_wrap (.~factor(ChapterR, 
                            levels=chapter_label), 
                   ncol=4)+
       theme(axis.title.x = element_blank(),
             axis.text.x = element_blank(),
             axis.ticks.x = element_blank(),
             legend.title=element_blank())}
   
   else if (!input$DefYear&input$DefArt) 
   {
     ggplot(data = resultc2P_1(), 
            aes( x = factor(Comment,levels = fieldsT2()),y = QNT, label=QNT, 
                 fill = factor(Comment,levels = fieldsT2()))) +
       scale_y_continuous(labels = point)+
       facet_wrap (.~factor(Article), 
                   ncol=4)+
       geom_bar(stat = "identity")+ylab("відносні значення (%)")+
       theme(axis.title.x = element_blank(),
             axis.text.x = element_blank(),
             axis.ticks.x = element_blank(),
             legend.title=element_blank())}
   
   else if (input$DefYear&!input$DefChap&!input$DefArt)
   {
     ggplot (data = resultc2P_1(),
             aes (x=factor(Year), y = QNT, label=QNT,
                  color=factor(Comment,levels = fieldsT2())))+
       scale_y_continuous(labels = point)+ylab("відносні значення (%)")+
       geom_point()+geom_line(aes(group=Comment))+
       theme(axis.title.x = element_blank(),
             legend.title=element_blank())
   }
   
   else if (input$DefYear&input$DefChap&!input$DefArt)
   {
     ggplot (data = resultc2P_1(),
             aes (x=factor(Year), y = QNT, label=QNT,
                  color=factor(Comment,levels = fieldsT2())))+
       scale_y_continuous(labels = point)+ylab("відносні значення (%)")+
       geom_point()+geom_line(aes(group=Comment))+
       facet_wrap (.~factor(ChapterR, 
                            levels=chapter_label), 
                   ncol=4)+
       theme(axis.title.x = element_blank(),
             legend.title=element_blank(),
             axis.text.x=element_text(angle = 90))
   }
   
   else if (input$DefYear&input$DefArt)
   {
     ggplot (data = resultc2P_1(),
             aes (x=factor(Year), y = QNT, label=QNT,
                  color=factor(Comment,levels = fieldsT())))+
       scale_y_continuous(labels = point)+ylab("відносні значення (%)")+
       geom_point()+geom_line(aes(group=Comment))+
       facet_wrap (.~factor(Article), 
                   ncol=4)+
       theme(axis.title.x = element_blank(),
             legend.title=element_blank(),
             axis.text.x=element_text(angle = 90))
   }
   
 })
 
 
 ##############Chapter-Year
 
 
 staloR_YR<-reactive({rule%>%select(input$fieldsYR)%>%filter(row_number()==1)})
 
 fieldsT2_YR<-reactive({c("Year","ChapterR", unlist(staloR_YR()))})
 fieldsT2_YR_t<-reactive({c("Рік","Розділ", unlist(staloR_YR()))})


 resultYR <- reactive({req (input$fieldsYR)
   
             crimesCHPT%>%select(Year,ChapterR,input$fieldsYR)%>%
               group_by(Year, ChapterR)%>%
               setNames(fieldsT2_YR())%>%
               as.data.frame()%>%
               reshape(timevar = "Comment", 
                       times=fieldsT2_YR()[3:length(fieldsT2_YR())],
                       v.names = "QNT", 
                       varying=fieldsT2_YR()[3:length(fieldsT2_YR())],
                       direction = "long")
             
           } )
 
 
 result_YR_tab<- reactive(
   {
     crimesCHPT%>%select(Year,ChapterR,input$fieldsYR)%>%
       group_by(Year, ChapterR)%>%
       setNames(fieldsT2_YR_t())%>%
       as.data.frame()
   }
 )
 
 
 output$download_tab_cYR <- downloadHandler(
   filename = function() 
   {
     paste("karchevskyi-table-YR-",format(Sys.Date(),"%d-%m-%Y"),".xlsx",sep = "")},
   content=function(file){
     
     write.xlsx(result_YR_tab(),file)}
 )
 
 output$download_cYR <- downloadHandler(
   filename = function() 
   {
     paste ("yearly-",format(Sys.Date(),"%d-%m-%Y"),".png")
   },
   content=function(file)
   {
     ggsave (filename= file, plot=plot1_1YR()+
               ggtitle(
                 "Візуалізація на підставі звітів за період з 2013 по 2022 рік, представлених на 
офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації.
Створено у веб-застосунку - Карчевський М. В. Протидія злочинності в Україні: інфографіка : інтерактивний довідник.",
                 subtitle = paste("URL :https://karchevskiy.org/i-dovidnyk/ (дата звернення :",format(Sys.Date(),"%d.%m.%Y"),")")),
             device="png",
             width = 16, height = 9, dpi = 300, units = "in" )
   }
 )  
 
 
 plot1_1YR<-reactive({if(input$labelsYR) 
 {plot1_YR()+geom_text(aes(angle=90,y=max(resultYR()$QNT/2)), position=position_dodge(.9))}
   else {plot1_YR()}
   
   
 })
 
 output$graph_cYR<-renderPlot(plot1_1YR())
 
 
 
 
 
 
 plot1_YR<-reactive (
   {
     ggplot (data = resultYR(),
             aes (x=factor(ChapterR, levels = chapter_label), y = QNT, label=QNT,
                  fill=factor(Comment, levels = unlist(staloR_YR()))))+
       scale_y_continuous(labels = point)+ylab("абсолютні значення")+
       geom_bar(stat = "identity", position = "dodge")+
       facet_wrap (.~factor(Year), 
                   ncol=1)+
       theme(axis.title.x = element_blank(),
             legend.title=element_blank(),
             axis.text.x=element_text(angle = 90))
 })
 
 ###############################
 
 resultYR_PR <- reactive({req (input$fieldsYR)
   
   crimesCHPR%>%select(Year,ChapterR,input$fieldsYR)%>%
     group_by(Year, ChapterR)%>%
     setNames(fieldsT2_YR())%>%
     as.data.frame()%>%
     reshape(timevar = "Comment", 
             times=fieldsT2_YR()[3:length(fieldsT2_YR())],
             v.names = "QNT", 
             varying=fieldsT2_YR()[3:length(fieldsT2_YR())],
             direction = "long")
   
 } )
 
 
 result_YR_P_tab <- reactive({req (input$fieldsYR)
   
   crimesCHPR%>%select(Year,ChapterR,input$fieldsYR)%>%
     group_by(Year, ChapterR)%>%
     setNames(fieldsT2_YR_t())%>%
     as.data.frame()
    
 } )
 
 output$download_tab_P_YR <- downloadHandler(
   filename = function() 
   {
     paste("karchevskyi-table-P_YR-",format(Sys.Date(),"%d-%m-%Y"),".xlsx",sep = "")},
   content=function(file){
     
     write.xlsx(result_YR_P_tab(),file)}
 )
 
 
 
 plot1_1YR_PR<-reactive({if(input$labelsYR) 
 {plot1_YR_PR()+geom_text(aes(angle=90,y=max(resultYR_PR()$QNT/2)), position=position_dodge(.9))}
   else {plot1_YR_PR()}
   
   
 })
 
 output$proc_graphYR<-renderPlot(plot1_1YR_PR())
 
 
 
 
 output$download_P_YR <- downloadHandler(
   filename = function() 
   {
     paste ("yearly-P-",format(Sys.Date(),"%d-%m-%Y"),".png")
   },
   content=function(file)
   {
     ggsave (filename= file, plot=plot1_1YR_PR()+
               ggtitle(
                 "Візуалізація на підставі звітів за період з 2013 по 2022 рік, представлених на 
офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації.
Створено у веб-застосунку - Карчевський М. В. Протидія злочинності в Україні: інфографіка : інтерактивний довідник.",
                 subtitle = paste("URL :https://karchevskiy.org/i-dovidnyk/ (дата звернення :",format(Sys.Date(),"%d.%m.%Y"),")
(дані у відсотковому представленні)")),
             device="png",
             width = 16, height = 9, dpi = 300, units = "in" )
   }
 )
 
 
 plot1_YR_PR<-reactive (
   {
     ggplot (data = resultYR_PR(),
             aes (x=factor(ChapterR, levels = chapter_label), y = QNT, label=QNT,
                  fill=factor(Comment, levels = unlist(staloR_YR()))))+
       scale_y_continuous(labels = point)+ylab("відсотки")+
       geom_bar(stat = "identity", position = "dodge")+
       facet_wrap (.~factor(Year), 
                   ncol=1)+
       theme(axis.title.x = element_blank(),
             legend.title=element_blank(),
             axis.text.x=element_text(angle = 90))
   })
 
 
 

 
  ###############V_MEJAH_ROZDILIV

 
 
 
 staloR_CH_YR<-reactive({rule%>%select(input$fieldsCH_YR)%>%filter(row_number()==1)})
 
 fieldsT2_CH_YR<-reactive({c("Year","Article", unlist(staloR_CH_YR()))})
 
 fieldsT2_CH_YR_t<-reactive({c("Рік","Стаття", unlist(staloR_CH_YR()))})
 
 resultCH_YR <- reactive({req (input$fieldsCH_YR)
   
   crimes%>%filter (ChapterTXT==input$ChapterCH) %>% 
     select(Year,Article,input$fieldsCH_YR)%>%
     group_by(Year, Article)%>%
     
     setNames(fieldsT2_CH_YR())%>%
     as.data.frame()%>%
     reshape(timevar = "Comment", 
             times=fieldsT2_CH_YR()[3:length(fieldsT2_CH_YR())],
             v.names = "QNT", 
             varying=fieldsT2_CH_YR()[3:length(fieldsT2_CH_YR())],
             direction = "long")
   
 } )
 
 
 resultCH_YR_t <- reactive({req (input$fieldsCH_YR)
   
   crimes%>%filter (ChapterTXT==input$ChapterCH) %>% 
     select(Year,Article,input$fieldsCH_YR)%>%
     group_by(Year, Article)%>%
     
     setNames(fieldsT2_CH_YR_t())%>%
     as.data.frame()
   
 } )
 
 
 
 
 output$download_tCH_YR <- downloadHandler(
   filename = function() 
   {
     paste("karchevskyi-table-CH_YR-",format(Sys.Date(),"%d-%m-%Y"),".xlsx",sep = "")},
   content=function(file){
     
     write.xlsx(resultCH_YR_t(),file)}
 )
 
 
 
 
 
 
 output$download_cCH_YR <- downloadHandler(
   filename = function() 
   {
     paste ("yearly-CH-",format(Sys.Date(),"%d-%m-%Y"),".png")
   },
   content=function(file)
   {
     ggsave (filename= file, plot=plot1_1YR_CH()+
               ggtitle(
                 "Візуалізація на підставі звітів за період з 2013 по 2022 рік, представлених на 
офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації.
Створено у веб-застосунку - Карчевський М. В. Протидія злочинності в Україні: інфографіка : інтерактивний довідник.",
                 subtitle = paste("URL :https://karchevskiy.org/i-dovidnyk/ (дата звернення :",format(Sys.Date(),"%d.%m.%Y"),")")),
             device="png",
             width = 16, height = 9, dpi = 300, units = "in" )
   }
 )  
 
 
 plot1_1YR_CH<-reactive({if(input$labelsCH_YR) 
 {plot1_YR_CH()+geom_text(aes(angle=90,y=max(resultCH_YR()$QNT/2)), position=position_dodge(.9))}
   else {plot1_YR_CH()}
   
   
 })
 
 output$graph_cCH_YR<-renderPlot(plot1_1YR_CH())
 
 
 
 
 
 
 plot1_YR_CH<-reactive (
   {
     ggplot (data = resultCH_YR(),
             aes (x=factor(Article), y = QNT, label=QNT,
                  fill=factor(Comment, levels = unlist(staloR_CH_YR()))))+
       scale_y_continuous(labels = point)+ylab("абсолютні значення")+
       geom_bar(stat = "identity", position = "dodge")+
       facet_wrap (.~factor(Year), 
                   ncol=1)+
       theme(axis.title.x = element_blank(),
             legend.title=element_blank(),
             axis.text.x=element_text(angle = 90))
   })
 
 
 
###Procent in Chapter
 
 
 
 resultP_CH_YR <- reactive({req (input$fieldsCH_YR)
   
   crimesPR%>%filter (ChapterTXT==input$ChapterCH) %>% 
     select(Year,Article,input$fieldsCH_YR)%>%
     group_by(Year, Article)%>%
     
     setNames(fieldsT2_CH_YR())%>%
     as.data.frame()%>%
     reshape(timevar = "Comment", 
             times=fieldsT2_CH_YR()[3:length(fieldsT2_CH_YR())],
             v.names = "QNT", 
             varying=fieldsT2_CH_YR()[3:length(fieldsT2_CH_YR())],
             direction = "long")
   
 } )
 
 
 resultP_CH_YR_t <- reactive({req (input$fieldsCH_YR)
   
   crimesPR%>%filter (ChapterTXT==input$ChapterCH) %>% 
     select(Year,Article,input$fieldsCH_YR)%>%
     group_by(Year, Article)%>%
     
     setNames(fieldsT2_CH_YR_t())%>%
     as.data.frame()
   
 } )
  
 
 
 
 
 output$download_t_P_CH_YR <- downloadHandler(
   filename = function() 
   {
     paste("karchevskyi-table-P-CH_YR-",format(Sys.Date(),"%d-%m-%Y"),".xlsx",sep = "")},
   content=function(file){
     
     write.xlsx(resultP_CH_YR_t(),file)}
 )
 
 
 
 
 
 
 output$download_P_CH_YR <- downloadHandler(
   filename = function() 
   {
     paste ("karchevskyi-yearly-P-CH-YR",format(Sys.Date(),"%d-%m-%Y"),".png")
   },
   content=function(file)
   {
     ggsave (filename= file, plot=plot1_1_P_YR_CH()+
               ggtitle(
                 "Візуалізація на підставі звітів за період з 2013 по 2022 рік, представлених на 
офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації.
Створено у веб-застосунку - Карчевський М. В. Протидія злочинності в Україні: інфографіка : інтерактивний довідник.",
                 subtitle = paste("URL :https://karchevskiy.org/i-dovidnyk/ (дата звернення :",format(Sys.Date(),"%d.%m.%Y"),")","
", input$ChapterCH, "
(дані у відстоковому представленні)")),
             device="png",
             width = 16, height = 9, dpi = 300, units = "in" )
   }
 )  
 
 
 plot1_1_P_YR_CH<-reactive({if(input$labelsCH_YR) 
 {plot1_P_YR_CH()+geom_text(aes(angle=90,y=max(resultP_CH_YR()$QNT/2)), position=position_dodge(.9))}
   else {plot1_P_YR_CH()}
   
   
 })
 
 output$proc_graphCHYR<-renderPlot(plot1_1_P_YR_CH())
 
 
 
 
 
 
 plot1_P_YR_CH<-reactive (
   {
     ggplot (data = resultP_CH_YR(),
             aes (x=factor(Article), y = QNT, label=QNT,
                  fill=factor(Comment, levels = unlist(staloR_CH_YR()))))+
       scale_y_continuous(labels = point)+ylab("відсотки")+
       geom_bar(stat = "identity", position = "dodge")+
       facet_wrap (.~factor(Year), 
                   ncol=1)+
       theme(axis.title.x = element_blank(),
             legend.title=element_blank(),
             axis.text.x=element_text(angle = 90))
   })
 
 
 
 
 #################BY ARTICLES BY PARTS
 constr_ARTch<-reactive({chapter$chn[chapter$chap %in% input$ChapterART]})
  constr_ART2<-reactive({ 
   articles$header[articles$chapt %in% constr_ARTch()]
 })
 
 output$articleART<-renderUI ({
   
   selectInput("art_ART", "Стаття:",
               choices = constr_ART2(),
               selectize = TRUE,
               multiple = FALSE,
               selected = constr_ART2()[1]
   )
 })
 ##############################################################
 
 staloR_ART<-reactive({rule%>%select(input$fieldsART)%>%filter(row_number()==1)})
 
 fieldsT2_ART<-reactive({c("Year","Article", "Part", unlist(staloR_ART()))})
 
 fieldsT2_ART_t<-reactive({c("Рік","Стаття", "Частина", unlist(staloR_ART()))})
 
 resultART <- reactive({req (input$fieldsART)
   req (input$art_ART)
   dsa%>%filter (nazva==input$art_ART) %>% 
     select(Year,Article,Part, input$fieldsART)%>%
     group_by(Year, Article, Part)%>%
     
     setNames(fieldsT2_ART())%>%
     as.data.frame()%>%
     reshape(timevar = "Comment", 
             times=fieldsT2_ART()[4:length(fieldsT2_ART())],
             v.names = "QNT", 
             varying=fieldsT2_ART()[4:length(fieldsT2_ART())],
             direction = "long")
   
 } )
 
 
 resultART_t <- reactive({req (input$fieldsART)
   req (input$art_ART)
   dsa%>%filter (nazva==input$art_ART) %>% 
     select(Year,Article,Part, input$fieldsART)%>%
     group_by(Year, Article, Part)%>%
     
     setNames(fieldsT2_ART_t())%>%
     as.data.frame()
   
 } )
 
 plot_ART<- reactive({
   ggplot (data = resultART(),
           aes (x=factor(Year), y = QNT, label=QNT,
                color=factor(Comment,levels = staloR_ART())))+
     scale_y_continuous(labels = point)+ylab("абсолютні значення")+
     geom_point()+geom_line(aes(group=Comment))+
     facet_wrap (.~factor(Part), 
                 ncol=2)+
     theme(axis.title.x = element_blank(),
           legend.title=element_blank(),
           axis.text.x=element_text(angle = 90))
 })
 
 
 plotART_1<-reactive(
   if(input$labelsART) {plot_ART()+geom_label(nudge_y = 0.01)}
   else
     plot_ART()
   
 )

  output$graph_ART<-renderPlot(plotART_1())
 
  
  
  output$download_tART <- downloadHandler(
    filename = function() 
    {
      paste("karchevskyi-ART-T-",format(Sys.Date(),"%d-%m-%Y"),".xlsx",sep = "")},
    content=function(file){
      
      write.xlsx(resultART_t(),file)}
  )
  
  
  
  
  
  
  output$download_ART <- downloadHandler(
    filename = function() 
    {
      paste ("karchevskyi-ART",format(Sys.Date(),"%d-%m-%Y"),".png")
    },
    content=function(file)
    {
      ggsave (filename= file, plot=plotART_1()+
                ggtitle(
                  "Візуалізація на підставі звітів за період з 2013 по 2022 рік, представлених на 
офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації.
Створено у веб-застосунку - Карчевський М. В. Протидія злочинності в Україні: інфографіка : інтерактивний довідник.",
                  subtitle = paste("URL :https://karchevskiy.org/i-dovidnyk/ (дата звернення :",format(Sys.Date(),"%d.%m.%Y"),")
", input$art_ART, " (дані по частинах статті)")),
              device="png",
              width = 16, height = 9, dpi = 300, units = "in" )
    }
  )  
  
  
  
 
  ###Proc by part
  
  
  resultART_P <- reactive({req (input$fieldsART)
    req (input$art_ART)
    
    dsaPR%>%filter (nazva==input$art_ART) %>% 
      select(Year,Article,Part, input$fieldsART)%>%
      group_by(Year, Article, Part)%>%
      
      setNames(fieldsT2_ART())%>%
      as.data.frame()%>%
      reshape(timevar = "Comment", 
              times=fieldsT2_ART()[4:length(fieldsT2_ART())],
              v.names = "QNT", 
              varying=fieldsT2_ART()[4:length(fieldsT2_ART())],
              direction = "long")
    
  } )
  
  
  resultART_Pt <- reactive({req (input$fieldsART)
    req (input$art_ART)
    
    dsaPR%>%filter (nazva==input$art_ART) %>% 
      select(Year,Article,Part, input$fieldsART)%>%
      group_by(Year, Article, Part)%>%
      
      setNames(fieldsT2_ART_t())%>%
      as.data.frame()
    
  } )
  
  plot_ART_P<- reactive({
    ggplot (data = resultART_P(),
            aes (x=factor(Year), y = QNT, label=QNT,
                 color=factor(Comment,levels = staloR_ART())))+
      scale_y_continuous(labels = point)+ylab("абсолютні значення")+
      geom_point()+geom_line(aes(group=Comment))+
      facet_wrap (.~factor(Part), 
                  ncol=2)+
      theme(axis.title.x = element_blank(),
            legend.title=element_blank(),
            axis.text.x=element_text(angle = 90))
  })
  
  
  plotART_P1<-reactive(
    if(input$labelsART) {plot_ART_P()+geom_label(nudge_y = 0.01)}
    else
      plot_ART_P()
    
  )
  
  output$proc_graph_ART<-renderPlot(plotART_P1())
  
  output$download_t_P_ART <- downloadHandler(
    filename = function() 
    {
      paste("karchevskyi-ART-PT-",format(Sys.Date(),"%d-%m-%Y"),".xlsx",sep = "")},
    content=function(file){
      
      write.xlsx(resultART_Pt(),file)}
  )
  
  
  
  
  
  
  output$download_P_ART <- downloadHandler(
    filename = function() 
    {
      paste ("karchevskyi-ART_P",format(Sys.Date(),"%d-%m-%Y"),".png")
    },
    content=function(file)
    {
      ggsave (filename= file, plot=plotART_P1()+
                ggtitle(
                  "Візуалізація на підставі звітів за період з 2013 по 2022 рік, представлених на 
офіційних сайтах Офісу Генерального прокурора України та Державної судової адміністрації.
Створено у веб-застосунку - Карчевський М. В. Протидія злочинності в Україні: інфографіка : інтерактивний довідник.",
                  subtitle = paste("URL :https://karchevskiy.org/i-dovidnyk/ (дата звернення :",format(Sys.Date(),"%d.%m.%Y"),")
", input$art_ART, "
(дані по частинах статті у відсотковому представленні)")),
              device="png",
              width = 16, height = 9, dpi = 300, units = "in" )
    }
  )  
  
  
  
 }


shinyApp(ui = ui, server = server)
